000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID.    E62750.
000400 DATE-WRITTEN.  90/11/15.
002600 ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. HITACM.
       OBJECT-COMPUTER. HITACM.
       SPECIAL-NAMES.
           ENVIRONMENT-NAME  IS ENV-NAME
           ENVIRONMENT-VALUE IS ENV-VALUE.
003000
       FILE-CONTROL.
         SELECT O1A-STATUS-FL ASSIGN TO EXTERNAL SYS031
         ORGANIZATION SEQUENTIAL.
         SELECT O2A-SHIYOU-BETSU-FL ASSIGN TO EXTERNAL SYS032
         ORGANIZATION SEQUENTIAL.
         SELECT O3A-SHAKEI-BETSU-FL ASSIGN TO EXTERNAL SYS033
         ORGANIZATION SEQUENTIAL.
         SELECT O4A-JIKEI-RETSU-FL ASSIGN TO EXTERNAL SYS034
         ORGANIZATION SEQUENTIAL.
         SELECT O5A-KOUTEI-KEIKAKU-FL ASSIGN TO EXTERNAL SYS035
         ORGANIZATION SEQUENTIAL.
         SELECT O6A-SEQUENCE-FL ASSIGN TO EXTERNAL SYS036
         ORGANIZATION SEQUENTIAL.
         SELECT MLS-SYSIN ASSIGN TO EXTERNAL SYSIN.
       DATA            DIVISION.
       FILE SECTION.
       FD O1A-STATUS-FL.
       01 SYS031-REC                     PIC X(1030).
       FD O2A-SHIYOU-BETSU-FL.
       01 SYS032-REC                     PIC X(497).
       FD O3A-SHAKEI-BETSU-FL.
       01 SYS033-REC                     PIC X(717).
       FD O4A-JIKEI-RETSU-FL.
       01 SYS034-REC                     PIC X(126).
       FD O5A-KOUTEI-KEIKAKU-FL.
       01 SYS035-REC                     PIC X(154).
       FD O6A-SEQUENCE-FL.
       01 SYS036-REC                     PIC X(80).
       FD MLS-SYSIN.
       01 MLS-SYSIN-REC                  PIC X(80).
003200 WORKING-STORAGE SECTION.
LNXADD 01  RESPONSE-CODEOPN   PIC S9(04) COMP-5 VALUE 0.
       01   STATUS-181-CR01.
LNXADD      02  RESPONSE-CODECR01   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR01
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR01.
                03 S181A-STATUS-KEY.
                    04 S181A-KOUJOU-KUBUN     PIC X(1).
                    04 S181A-KOUJOU-CONTROL-NO PIC X(11).
                03 S181A-MODEL                PIC X(18).
                03 S181A-COLOR                PIC X(3).
                03 S181A-UCHIBARI             PIC X(1).
                03 S181A-EX-NO                PIC X(5).
                03 S181A-SHIMUKECHI           PIC X(3).
                03 S181A-LINE-KUBUN.
                    04 S181A-LINE-MAIN        PIC X(1).
                    04 S181A-LINE-METAL       PIC X(1).
                    04 S181A-LINE-PAINT       PIC X(1).
                    04 S181A-LINE-TRIM        PIC X(1).
                03 S181A-KOKUYU-KUBUN         PIC X(1).
                03 S181A-KIJUN-SHAKEI         PIC X(5).
                03 S181A-SHATAI-BANGOU-KATASHIKI.
                    04 S181A-DAKOKU-KATASHIKI PIC X(12).
                    04 S181A-CHASSIS-NO       PIC X(8).
                03 S181A-ENGINE.
                    04 S181A-ENG-KATASHIKI    PIC X(12).
                    04 S181A-ENG-NO           PIC X(8).
                03 S181A-ORIGINAL-INFO.
                    04 S181A-ORG-MODEL        PIC X(18).
                    04 S181A-ORG-COLOR        PIC X(3).
                    04 S181A-ORG-UCHIBARI     PIC X(1).
                    04 S181A-ORG-EX-NO        PIC X(5).
                    04 S181A-ORG-LINE-KUBUN   PIC X(4).
                    04 S181A-SHAKEI-CODE      PIC X(6).
                    04 S181A-SHAMEI-CODE      PIC X(6).
                03 S181A-DEALER-INFO.
                    04 S181A-ORDER-KUBUN      PIC X(1).
                    04 S181A-DEALER-NO        PIC X(4).
                    04 S181A-ORDER-NO         PIC X(6).
                    04 S181A-COMFIRMED-ORDER-NO PIC X(12).
                    04 S181A-CUSTOMER-NAME    PIC X(41).
                    04 S181A-TENJI-PRY-CODE   PIC X(1).
                03 S181A-STATUS-POINT         PIC X(2).
                03  S181A-G-KOUTEI-JISSEKI.
                    04 S181A-KOUTEI-JISSEKI OCCURS 17.
                        05 S181A-JISSEKI-JIKOKU PIC S9(11) COMP-3.
                03  S181A-G-KOUTEI-KEIKAKU.
                    04 S181A-KOUTEI-KEIKAKU OCCURS 17.
                        05 S181A-ORIGINAL-KEIKAKU PIC S9(11) COMP-3.
                        05 S181A-REVISED2-KEIKAKU PIC S9(11) COMP-3.
                        05 S181A-REVISED1-KEIKAKU PIC S9(11) COMP-3.
                        05 S181A-IKKATSU-SYM2 PIC X(1).
                        05 S181A-IKKATSU-SYM1 PIC X(1).
                        05 S181A-YOTEI-INPUT-JIKOKU PIC S9(9) COMP-3.
                        05 S181A-HANEDASHI-RIYUU1 PIC X(2).
                        05 S181A-HANEDASHI-RIYUU2 PIC X(2).
                03 S181A-DELIVERY-LEAD-TIME.
                    04 S181A-DELIVERY-LEAD-KOTEI PIC S9(5) COMP-3.
                    04 S181A-DELIVERY-LEAD-YOYUU PIC S9(5) COMP-3.
                03 S181A-IKAN-INFO.
                    04 S181A-IKANSAKI         PIC X(4).
                    04 S181A-KENSA-IKAN-SHIKIBETSU PIC X(1).
                03 S181A-KASOU-INFO.
                    04 S181A-KASOUSHA-SYM     PIC X(1).
                    04 S181A-KASOU-MAKER      PIC X(4).
                    04 S181A-KASOU-KANRYOU-LEAD PIC S9(5) COMP-3.
                03 S181A-TOKKI-JIKOU          PIC X(20).
                03 S181A-ACT-SCH-KEY          PIC X(1).
                03 S181A-ACT-SEQ-NO           PIC X(10).
                03 S181A-SHATAI-RE-ACT-SEQ-NO PIC X(11).
                03 S181A-FINAL-RE-ACT-SEQ-NO  PIC X(11).
                03 S181A-TRIM-SEQ-NO          PIC X(6).
                03 S181A-OFFLINE-SEQ-NO       PIC X(6).
                03 S181A-KANKEN-YMD           PIC X(6).
                03 S181A-MS-OFFLINE-YMD       PIC X(10).
                03 S181A-SYM-TOKUSHUSHA       PIC X(1).
                03 S181A-SYM-KOUTEI-KEIKAKU-GAI PIC X(1).
                03 S181A-SYM-ZAIKO-ZUMI       PIC X(1).
                03 S181A-SYM-GYAKUBARASHI-GAI PIC X(1).
                03 S181A-SYM-SENKOU-MI-GAI    PIC X(1).
                03 S181A-SYM-GROUP-SENKOU-MI.
                    04 S181A-SYM-SM-DAIHYOU   PIC X(1).
                    04 S181A-SYM-SM-KOUTEI    PIC X(1)
                               OCCURS 17.
                03 S181A-SYM-ZENGETSU-JISSEKI PIC X(1)
                               OCCURS 17.
                03 S181A-SYM-TOKKYU-LABEL.
                    04 S181A-SYM-TL-METAL     PIC X(1).
                    04 S181A-SYM-TL-SHITA-P   PIC X(1).
                    04 S181A-SYM-TL-NAKA-P    PIC X(1).
                    04 S181A-SYM-TL-PAINT     PIC X(1).
                    04 S181A-SYM-TL-FINAL     PIC X(1).
                    04 S181A-SYM-TL-DELIV     PIC X(1).
                03 S181A-PIPE-LINE-ITEM.
                    04 S181A-SYM-PIPE-LINE-GAI PIC X(1).
                    04 S181A-SYM-PIPE-LINE-ZUMI PIC X(1).
                    04 S181A-SYM-KEIKAKU-MITEI PIC X(1).
                    04 S181A-SEISAN-HOUSHIKI  PIC X(1).
                    04 S181A-SYM-SHISAKU-SHA  PIC X(1).
                03 S181A-SYM-GYAKU-YUNYUU     PIC X(1).
                03 S181A-HYOUJI-GENZAICHI     PIC X(1).
                03 S181A-SALES-SPEC-10        PIC X(10).
                03 S181A-LOCAL-AREA           PIC X(50).
                03 S181A-TIME-STAMP           PIC X(12).
                03 S181A-DELIV-EIGYOU-HIZUKE  PIC S9(11) COMP-3.
                03 S181A-SYM-HANEDASHI        PIC X(1).
                03 S181A-SEIHIN-KUBUN         PIC X(1).
       01   SHIYOU-182-CR02.
LNXADD      02  RESPONSE-CODECR02   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR02
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR02.
                03 S182A-KOUJOU-KUBUN         PIC X(1).
                03 S182A-MODEL                PIC X(18).
                03 S182A-COLOR-UCHIBARI-EX    PIC X(9).
                03 S182A-LINE-TRIM            PIC X(1).
                03 S182A-KOKUYU-KUBUN         PIC X(1).
                03 S182A-YYMM                 PIC X(4).
                03 S182A-KOUTEI-ID            PIC X(2).
                03 S182A-JISSEKI.
                    04 S182A-JISSEKI-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-JISSEKI-TOUGETSU PIC X(126).
                    04 S182A-JISSEKI-JIGETSU  PIC X(82).
                03 S182A-KEIKAKU.
                    04 S182A-RUISA-ZEN-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-KEIKAKU-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-RUISA-ZENGETSU   PIC S9(5) COMP-3.
                    04 S182A-KEIKAKU-TOUGETSU PIC X(126).
                    04 S182A-KEIKAKU-JIGETSU  PIC X(82).
                03 S182A-IKAN.
                    04 S182A-IKAN-ZENGETSU    PIC S9(5) COMP-3.
                    04 S182A-IKAN-TOUGETSU    PIC S9(5) COMP-3.
                    04 S182A-IKAN-JIGETSU     PIC S9(5) COMP-3.
                03 S182A-SHIKYUU.
                    04 S182A-SHIKYUU-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-SHIKYUU-TOUGETSU PIC S9(5) COMP-3.
                    04 S182A-SHIKYUU-JIGETSU  PIC S9(5) COMP-3.
                03 S182A-MIKEN-ZAIKO.
                    04 S182A-MIKEN-ZEN-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-MIKEN-ZENGETSU   PIC S9(5) COMP-3.
                03 S182A-KANKEN-ZAIKO.
                    04 S182A-KANKEN-ZEN-ZENGETSU PIC S9(5) COMP-3.
                    04 S182A-KANKEN-ZENGETSU  PIC S9(5) COMP-3.
       01   SHAKEI-183-CR03.
LNXADD      02  RESPONSE-CODECR03   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR03
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR03.
                03 S183A-KOUJOU-KUBUN         PIC X(1).
                03 S183A-SHAKEI-CODE          PIC X(6).
                03 S183A-LINE-KUBUN           PIC X(4).
                03 S183A-YYMM                 PIC X(4).
                03 S183A-KOUTEI-ID            PIC X(2).
                03 S183A-JISSEKI.
                    04 S183A-JISSEKI-ZENGETSU PIC S9(5) COMP-3.
                    04 S183A-JISSEKI-TOUGETSU PIC X(126).
                    04 S183A-JISSEKI-JIGETSU  PIC X(82).
                03 S183A-KEIKAKU.
                    04 S183A-RUISA-ZEN-ZENGETSU PIC S9(5) COMP-3.
                    04 S183A-KEIKAKU-ZENGETSU PIC S9(5) COMP-3.
                    04 S183A-RUISA-ZENGETSU   PIC S9(5) COMP-3.
                    04 S183A-KEIKAKU-TOUGETSU PIC X(126).
                    04 S183A-KEIKAKU-JIGETSU  PIC X(82).
                03 S183A-OH-TAISHOU-SHIFT.
                    04 S183A-ZEN-ZEN-SHIFT    PIC S9(5) COMP-3.
                    04 S183A-ZEN-SHIFT        PIC S9(5) COMP-3.
                    04 S183A-TOU-SHIFT        PIC S9(5) COMP-3.
                    04 S183A-JI-SHIFT         PIC S9(5) COMP-3.
                03  S183A-G-JISSEKI-OH.
                    04 S183A-JISSEKI-OH OCCURS 4.
                        05 S183A-JISSEKI-OH-METAL1 PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-METAL2 PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-WBS PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-SHITA-P PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-NAKA-P PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-UWA-P PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-PBS PIC S9(5) COMP-3.
                        05 S183A-JISSEKI-OH-PRE-TRIM PIC S9(5) COMP-3.
                        05 S183A-JIKKEKI-OH-TRIM PIC S9(5) COMP-3.
                        05 S183A-JIKKEKI-OH-FINAL PIC S9(5) COMP-3.
                        05 S183A-JIKKEKI-OH-KASOU PIC S9(5) COMP-3.
                        05 S183A-JIKKEKI-OH-DELIV PIC S9(5) COMP-3.
                        05 S183A-JIKKEKI-OH-UKEIRE PIC S9(5) COMP-3.
                03  S183A-G-KEIKAKU-OH.
                    04 S183A-KEIKAKU-OH OCCURS 4.
                        05 S183A-KEIKAKU-OH-METAL1 PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-METAL2 PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-WBS PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-SHITA-P PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-NAKA-P PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-UWA-P PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-PBS PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-PRE-TRIM PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-TRIM PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-FINAL PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-KASOU PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-DELIV PIC S9(3) COMP-3.
                        05 S183A-KEIKAKU-OH-UKEIRE PIC S9(3) COMP-3.
       01   JIKEI-184-CR04.
LNXADD      02  RESPONSE-CODECR04   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR04
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR04.
                03 S184A-KOUJOU-KUBUN         PIC X(1).
                03 S184A-SHAKEI-CODE          PIC X(6).
                03 S184A-LINE-KUBUN           PIC X(4).
                03 S184A-SHIFT                PIC X(7).
                03 S184A-KOUTEI-ID            PIC X(2).
                03 S184A-KAISHI-JIKOKU        PIC X(2).
                03 S184A-JISSEKI.
                    04 S184A-JISSEKI-KAISHI-IZEN PIC S9(3) COMP-3.
                    04 S184A-JISSEKI-HH-TBL   PIC X(48).
                    04 S184A-JISSEKI-12H-IKOU PIC S9(3) COMP-3.
                03 S184A-KEIKAKU.
                    04 S184A-KEIKAKU-KAISHI-IZEN PIC S9(3) COMP-3.
                    04 S184A-KEIKAKU-HH-TBL   PIC X(48).
                    04 S184A-KEIKAKU-12H-IKOU PIC S9(3) COMP-3.
       01   KOUTEI-185-CR05.
LNXADD      02  RESPONSE-CODECR05   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR05
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR05.
                03 S185A-KOUJOU-KUBUN-FILE-ID PIC X(1).
                03 S185A-ACT-GROUP            PIC X(1).
                03 S185A-ACT-LINE-COD         PIC X(6).
                03 S185A-YYYYMM               PIC X(6).
                03 S185A-KOUTEI-KEIKAKU-ID    PIC X(2).
                03  S185A-G-KEIKAKU.
                    04 S185A-KEIKAKU OCCURS 63.
                        05 S185A-SHIFT-DAISU  PIC S9(3) COMP-3.
                03 S185A-TIME-STAMP           PIC X(12).
       01   SEQUENCE-180-CR06.
LNXADD      02  RESPONSE-CODECR06   PIC S9(04) COMP-5 VALUE 0.
            02  RESPONSE-CODE REDEFINES RESPONSE-CODECR06
LNXADD                            PIC S9(04) COMP-5.
            02  RECORD-BUFCR06.
                03 S180A-CONTROL-KEY.
                    04 S180A-KOUJOU-KUBUN     PIC X(1).
                    04 S180A-KOUJOU-CONTROL-NO PIC X(11).
                03 S180A-ACT-DETAIL.
                    04 S180A-ACT-LINE-CODE    PIC X(6).
                    04 S180A-POINT2-SEQ-NO    PIC X(13).
                    04 S180A-POINT3-SEQ-NO    PIC X(13).
                    04 S180A-POINT4-SEQ-NO    PIC X(13).
                    04 S180A-TRANSPORT-DIRECTION-SYM PIC X(1).
                    04 S180A-DOUKISEISAN-SEQ-NO PIC X(4).
                    04 S180A-DELIVERY-PLAN-NON-MARGIN PIC X(11).
                03 S180A-MS-DETAIL.
                    04 S180A-PRODUCTION-MONTH PIC X(6).
                    04 S180A-MS-NO            PIC X(1).
       01  ALL-CURSOR-STATUS-FLAGS.
           02  CR01-DECLARED                       PIC X VALUE "N".
           02  CR01-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR01-OPENED                         PIC X VALUE "N".
           02  CR01-COUNT-OPENED                   PIC X VALUE "N".
           02  CR02-DECLARED                       PIC X VALUE "N".
           02  CR02-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR02-OPENED                         PIC X VALUE "N".
           02  CR02-COUNT-OPENED                   PIC X VALUE "N".
           02  CR03-DECLARED                       PIC X VALUE "N".
           02  CR03-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR03-OPENED                         PIC X VALUE "N".
           02  CR03-COUNT-OPENED                   PIC X VALUE "N".
           02  CR04-DECLARED                       PIC X VALUE "N".
           02  CR04-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR04-OPENED                         PIC X VALUE "N".
           02  CR04-COUNT-OPENED                   PIC X VALUE "N".
           02  CR05-DECLARED                       PIC X VALUE "N".
           02  CR05-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR05-OPENED                         PIC X VALUE "N".
           02  CR05-COUNT-OPENED                   PIC X VALUE "N".
           02  CR06-DECLARED                       PIC X VALUE "N".
           02  CR06-COUNT-DECLARED                 PIC X VALUE "N".
           02  CR06-OPENED                         PIC X VALUE "N".
           02  CR06-COUNT-OPENED                   PIC X VALUE "N".
           EXEC SQL DECLARE CR01 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN
                ,KOUJOU_CONTROL_NO
                ,MODEL
                ,COLOR
                ,UCHIBARI
                ,EX_NO
                ,SHIMUKECHI
                ,LINE_MAIN
                ,LINE_METAL
                ,LINE_PAINT
                ,LINE_TRIM
                ,KOKUYU_KUBUN
                ,KIJUN_SHAKEI
                ,DAKOKU_KATASHIKI
                ,CHASSIS_NO
                ,ENG_KATASHIKI
                ,ENG_NO
                ,ORG_MODEL
                ,ORG_COLOR
                ,ORG_UCHIBARI
                ,ORG_EX_NO
                ,ORG_LINE_KUBUN
                ,SHAKEI_CODE
                ,SHAMEI_CODE
                ,ORDER_KUBUN
                ,DEALER_NO
                ,ORDER_NO
                ,COMFIRMED_ORDER_NO
                ,CUSTOMER_NAME
                ,TENJI_PRY_CODE
                ,STATUS_POINT
                ,JISSEKI_JIKOKU_01
                ,JISSEKI_JIKOKU_02
                ,JISSEKI_JIKOKU_03
                ,JISSEKI_JIKOKU_04
                ,JISSEKI_JIKOKU_05
                ,JISSEKI_JIKOKU_06
                ,JISSEKI_JIKOKU_07
                ,JISSEKI_JIKOKU_08
                ,JISSEKI_JIKOKU_09
                ,JISSEKI_JIKOKU_10
                ,JISSEKI_JIKOKU_11
                ,JISSEKI_JIKOKU_12
                ,JISSEKI_JIKOKU_13
                ,JISSEKI_JIKOKU_14
                ,JISSEKI_JIKOKU_15
                ,JISSEKI_JIKOKU_16
                ,JISSEKI_JIKOKU_17
                ,ORIGINAL_KEIKAKU_01
                ,ORIGINAL_KEIKAKU_02
                ,ORIGINAL_KEIKAKU_03
                ,ORIGINAL_KEIKAKU_04
                ,ORIGINAL_KEIKAKU_05
                ,ORIGINAL_KEIKAKU_06
                ,ORIGINAL_KEIKAKU_07
                ,ORIGINAL_KEIKAKU_08
                ,ORIGINAL_KEIKAKU_09
                ,ORIGINAL_KEIKAKU_10
                ,ORIGINAL_KEIKAKU_11
                ,ORIGINAL_KEIKAKU_12
                ,ORIGINAL_KEIKAKU_13
                ,ORIGINAL_KEIKAKU_14
                ,ORIGINAL_KEIKAKU_15
                ,ORIGINAL_KEIKAKU_16
                ,ORIGINAL_KEIKAKU_17
                ,REVISED2_KEIKAKU_01
                ,REVISED2_KEIKAKU_02
                ,REVISED2_KEIKAKU_03
                ,REVISED2_KEIKAKU_04
                ,REVISED2_KEIKAKU_05
                ,REVISED2_KEIKAKU_06
                ,REVISED2_KEIKAKU_07
                ,REVISED2_KEIKAKU_08
                ,REVISED2_KEIKAKU_09
                ,REVISED2_KEIKAKU_10
                ,REVISED2_KEIKAKU_11
                ,REVISED2_KEIKAKU_12
                ,REVISED2_KEIKAKU_13
                ,REVISED2_KEIKAKU_14
                ,REVISED2_KEIKAKU_15
                ,REVISED2_KEIKAKU_16
                ,REVISED2_KEIKAKU_17
                ,REVISED1_KEIKAKU_01
                ,REVISED1_KEIKAKU_02
                ,REVISED1_KEIKAKU_03
                ,REVISED1_KEIKAKU_04
                ,REVISED1_KEIKAKU_05
                ,REVISED1_KEIKAKU_06
                ,REVISED1_KEIKAKU_07
                ,REVISED1_KEIKAKU_08
                ,REVISED1_KEIKAKU_09
                ,REVISED1_KEIKAKU_10
                ,REVISED1_KEIKAKU_11
                ,REVISED1_KEIKAKU_12
                ,REVISED1_KEIKAKU_13
                ,REVISED1_KEIKAKU_14
                ,REVISED1_KEIKAKU_15
                ,REVISED1_KEIKAKU_16
                ,REVISED1_KEIKAKU_17
                ,IKKATSU_SYM2_01
                ,IKKATSU_SYM2_02
                ,IKKATSU_SYM2_03
                ,IKKATSU_SYM2_04
                ,IKKATSU_SYM2_05
                ,IKKATSU_SYM2_06
                ,IKKATSU_SYM2_07
                ,IKKATSU_SYM2_08
                ,IKKATSU_SYM2_09
                ,IKKATSU_SYM2_10
                ,IKKATSU_SYM2_11
                ,IKKATSU_SYM2_12
                ,IKKATSU_SYM2_13
                ,IKKATSU_SYM2_14
                ,IKKATSU_SYM2_15
                ,IKKATSU_SYM2_16
                ,IKKATSU_SYM2_17
                ,IKKATSU_SYM1_01
                ,IKKATSU_SYM1_02
                ,IKKATSU_SYM1_03
                ,IKKATSU_SYM1_04
                ,IKKATSU_SYM1_05
                ,IKKATSU_SYM1_06
                ,IKKATSU_SYM1_07
                ,IKKATSU_SYM1_08
                ,IKKATSU_SYM1_09
                ,IKKATSU_SYM1_10
                ,IKKATSU_SYM1_11
                ,IKKATSU_SYM1_12
                ,IKKATSU_SYM1_13
                ,IKKATSU_SYM1_14
                ,IKKATSU_SYM1_15
                ,IKKATSU_SYM1_16
                ,IKKATSU_SYM1_17
                ,YOTEI_INPUT_JIKOKU_01
                ,YOTEI_INPUT_JIKOKU_02
                ,YOTEI_INPUT_JIKOKU_03
                ,YOTEI_INPUT_JIKOKU_04
                ,YOTEI_INPUT_JIKOKU_05
                ,YOTEI_INPUT_JIKOKU_06
                ,YOTEI_INPUT_JIKOKU_07
                ,YOTEI_INPUT_JIKOKU_08
                ,YOTEI_INPUT_JIKOKU_09
                ,YOTEI_INPUT_JIKOKU_10
                ,YOTEI_INPUT_JIKOKU_11
                ,YOTEI_INPUT_JIKOKU_12
                ,YOTEI_INPUT_JIKOKU_13
                ,YOTEI_INPUT_JIKOKU_14
                ,YOTEI_INPUT_JIKOKU_15
                ,YOTEI_INPUT_JIKOKU_16
                ,YOTEI_INPUT_JIKOKU_17
                ,HANEDASHI_RIYUU1_01
                ,HANEDASHI_RIYUU1_02
                ,HANEDASHI_RIYUU1_03
                ,HANEDASHI_RIYUU1_04
                ,HANEDASHI_RIYUU1_05
                ,HANEDASHI_RIYUU1_06
                ,HANEDASHI_RIYUU1_07
                ,HANEDASHI_RIYUU1_08
                ,HANEDASHI_RIYUU1_09
                ,HANEDASHI_RIYUU1_10
                ,HANEDASHI_RIYUU1_11
                ,HANEDASHI_RIYUU1_12
                ,HANEDASHI_RIYUU1_13
                ,HANEDASHI_RIYUU1_14
                ,HANEDASHI_RIYUU1_15
                ,HANEDASHI_RIYUU1_16
                ,HANEDASHI_RIYUU1_17
                ,HANEDASHI_RIYUU2_01
                ,HANEDASHI_RIYUU2_02
                ,HANEDASHI_RIYUU2_03
                ,HANEDASHI_RIYUU2_04
                ,HANEDASHI_RIYUU2_05
                ,HANEDASHI_RIYUU2_06
                ,HANEDASHI_RIYUU2_07
                ,HANEDASHI_RIYUU2_08
                ,HANEDASHI_RIYUU2_09
                ,HANEDASHI_RIYUU2_10
                ,HANEDASHI_RIYUU2_11
                ,HANEDASHI_RIYUU2_12
                ,HANEDASHI_RIYUU2_13
                ,HANEDASHI_RIYUU2_14
                ,HANEDASHI_RIYUU2_15
                ,HANEDASHI_RIYUU2_16
                ,HANEDASHI_RIYUU2_17
                ,DELIVERY_LEAD_KOTEI
                ,DELIVERY_LEAD_YOYUU
                ,IKANSAKI
                ,KENSA_IKAN_SHIKIBETSU
                ,KASOUSHA_SYM
                ,KASOU_MAKER
                ,KASOU_KANRYOU_LEAD
                ,TOKKI_JIKOU
                ,ACT_SCH_KEY
                ,ACT_SEQ_NO
                ,SHATAI_RE_ACT_SEQ_NO
                ,FINAL_RE_ACT_SEQ_NO
                ,TRIM_SEQ_NO
                ,OFFLINE_SEQ_NO
                ,KANKEN_YMD
                ,MS_OFFLINE_YMD
                ,SYM_TOKUSHUSHA
                ,SYM_KOUTEI_KEIKAKU_GAI
                ,SYM_ZAIKO_ZUMI
                ,SYM_GYAKUBARASHI_GAI
                ,SYM_SENKOU_MI_GAI
                ,SYM_SM_DAIHYOU
                ,SYM_SM_KOUTEI_01
                ,SYM_SM_KOUTEI_02
                ,SYM_SM_KOUTEI_03
                ,SYM_SM_KOUTEI_04
                ,SYM_SM_KOUTEI_05
                ,SYM_SM_KOUTEI_06
                ,SYM_SM_KOUTEI_07
                ,SYM_SM_KOUTEI_08
                ,SYM_SM_KOUTEI_09
                ,SYM_SM_KOUTEI_10
                ,SYM_SM_KOUTEI_11
                ,SYM_SM_KOUTEI_12
                ,SYM_SM_KOUTEI_13
                ,SYM_SM_KOUTEI_14
                ,SYM_SM_KOUTEI_15
                ,SYM_SM_KOUTEI_16
                ,SYM_SM_KOUTEI_17
                ,SYM_ZENGETSU_JISSEKI_01
                ,SYM_ZENGETSU_JISSEKI_02
                ,SYM_ZENGETSU_JISSEKI_03
                ,SYM_ZENGETSU_JISSEKI_04
                ,SYM_ZENGETSU_JISSEKI_05
                ,SYM_ZENGETSU_JISSEKI_06
                ,SYM_ZENGETSU_JISSEKI_07
                ,SYM_ZENGETSU_JISSEKI_08
                ,SYM_ZENGETSU_JISSEKI_09
                ,SYM_ZENGETSU_JISSEKI_10
                ,SYM_ZENGETSU_JISSEKI_11
                ,SYM_ZENGETSU_JISSEKI_12
                ,SYM_ZENGETSU_JISSEKI_13
                ,SYM_ZENGETSU_JISSEKI_14
                ,SYM_ZENGETSU_JISSEKI_15
                ,SYM_ZENGETSU_JISSEKI_16
                ,SYM_ZENGETSU_JISSEKI_17
                ,SYM_TL_METAL
                ,SYM_TL_SHITA_P
                ,SYM_TL_NAKA_P
                ,SYM_TL_PAINT
                ,SYM_TL_FINAL
                ,SYM_TL_DELIV
                ,SYM_PIPE_LINE_GAI
                ,SYM_PIPE_LINE_ZUMI
                ,SYM_KEIKAKU_MITEI
                ,SEISAN_HOUSHIKI
                ,SYM_SHISAKU_SHA
                ,SYM_GYAKU_YUNYUU
                ,HYOUJI_GENZAICHI
                ,SALES_SPEC_10
                ,LOCAL_AREA
                ,TIME_STAMP
                ,DELIV_EIGYOU_HIZUKE
                ,SYM_HANEDASHI
                ,SEIHIN_KUBUN
                ,ROWID
              FROM STATUS_181
              ORDER BY
                 KOUJOU_KUBUN
                ,KOUJOU_CONTROL_NO
           END-EXEC.
           EXEC SQL DECLARE CR02 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN
                ,MODEL
                ,COLOR_UCHIBARI_EX
                ,LINE_TRIM
                ,KOKUYU_KUBUN
                ,YYMM
                ,KOUTEI_ID
                ,JISSEKI_ZENGETSU
                ,JISSEKI_TOUGETSU
                ,JISSEKI_JIGETSU
                ,RUISA_ZEN_ZENGETSU
                ,KEIKAKU_ZENGETSU
                ,RUISA_ZENGETSU
                ,KEIKAKU_TOUGETSU
                ,KEIKAKU_JIGETSU
                ,IKAN_ZENGETSU
                ,IKAN_TOUGETSU
                ,IKAN_JIGETSU
                ,SHIKYUU_ZENGETSU
                ,SHIKYUU_TOUGETSU
                ,SHIKYUU_JIGETSU
                ,MIKEN_ZEN_ZENGETSU
                ,MIKEN_ZENGETSU
                ,KANKEN_ZEN_ZENGETSU
                ,KANKEN_ZENGETSU
                ,ROWID
              FROM SHIYOU_182
           END-EXEC.
           EXEC SQL DECLARE CR03 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN
                ,SHAKEI_CODE
                ,LINE_KUBUN
                ,YYMM
                ,KOUTEI_ID
                ,JISSEKI_ZENGETSU
                ,JISSEKI_TOUGETSU
                ,JISSEKI_JIGETSU
                ,RUISA_ZEN_ZENGETSU
                ,KEIKAKU_ZENGETSU
                ,RUISA_ZENGETSU
                ,KEIKAKU_TOUGETSU
                ,KEIKAKU_JIGETSU
                ,ZEN_ZEN_SHIFT
                ,ZEN_SHIFT
                ,TOU_SHIFT
                ,JI_SHIFT
                ,JISSEKI_OH_METAL1_01
                ,JISSEKI_OH_METAL1_02
                ,JISSEKI_OH_METAL1_03
                ,JISSEKI_OH_METAL1_04
                ,JISSEKI_OH_METAL2_01
                ,JISSEKI_OH_METAL2_02
                ,JISSEKI_OH_METAL2_03
                ,JISSEKI_OH_METAL2_04
                ,JISSEKI_OH_WBS_01
                ,JISSEKI_OH_WBS_02
                ,JISSEKI_OH_WBS_03
                ,JISSEKI_OH_WBS_04
                ,JISSEKI_OH_SHITA_P_01
                ,JISSEKI_OH_SHITA_P_02
                ,JISSEKI_OH_SHITA_P_03
                ,JISSEKI_OH_SHITA_P_04
                ,JISSEKI_OH_NAKA_P_01
                ,JISSEKI_OH_NAKA_P_02
                ,JISSEKI_OH_NAKA_P_03
                ,JISSEKI_OH_NAKA_P_04
                ,JISSEKI_OH_UWA_P_01
                ,JISSEKI_OH_UWA_P_02
                ,JISSEKI_OH_UWA_P_03
                ,JISSEKI_OH_UWA_P_04
                ,JISSEKI_OH_PBS_01
                ,JISSEKI_OH_PBS_02
                ,JISSEKI_OH_PBS_03
                ,JISSEKI_OH_PBS_04
                ,JISSEKI_OH_PRE_TRIM_01
                ,JISSEKI_OH_PRE_TRIM_02
                ,JISSEKI_OH_PRE_TRIM_03
                ,JISSEKI_OH_PRE_TRIM_04
                ,JIKKEKI_OH_TRIM_01
                ,JIKKEKI_OH_TRIM_02
                ,JIKKEKI_OH_TRIM_03
                ,JIKKEKI_OH_TRIM_04
                ,JIKKEKI_OH_FINAL_01
                ,JIKKEKI_OH_FINAL_02
                ,JIKKEKI_OH_FINAL_03
                ,JIKKEKI_OH_FINAL_04
                ,JIKKEKI_OH_KASOU_01
                ,JIKKEKI_OH_KASOU_02
                ,JIKKEKI_OH_KASOU_03
                ,JIKKEKI_OH_KASOU_04
                ,JIKKEKI_OH_DELIV_01
                ,JIKKEKI_OH_DELIV_02
                ,JIKKEKI_OH_DELIV_03
                ,JIKKEKI_OH_DELIV_04
                ,JIKKEKI_OH_UKEIRE_01
                ,JIKKEKI_OH_UKEIRE_02
                ,JIKKEKI_OH_UKEIRE_03
                ,JIKKEKI_OH_UKEIRE_04
                ,KEIKAKU_OH_METAL1_01
                ,KEIKAKU_OH_METAL1_02
                ,KEIKAKU_OH_METAL1_03
                ,KEIKAKU_OH_METAL1_04
                ,KEIKAKU_OH_METAL2_01
                ,KEIKAKU_OH_METAL2_02
                ,KEIKAKU_OH_METAL2_03
                ,KEIKAKU_OH_METAL2_04
                ,KEIKAKU_OH_WBS_01
                ,KEIKAKU_OH_WBS_02
                ,KEIKAKU_OH_WBS_03
                ,KEIKAKU_OH_WBS_04
                ,KEIKAKU_OH_SHITA_P_01
                ,KEIKAKU_OH_SHITA_P_02
                ,KEIKAKU_OH_SHITA_P_03
                ,KEIKAKU_OH_SHITA_P_04
                ,KEIKAKU_OH_NAKA_P_01
                ,KEIKAKU_OH_NAKA_P_02
                ,KEIKAKU_OH_NAKA_P_03
                ,KEIKAKU_OH_NAKA_P_04
                ,KEIKAKU_OH_UWA_P_01
                ,KEIKAKU_OH_UWA_P_02
                ,KEIKAKU_OH_UWA_P_03
                ,KEIKAKU_OH_UWA_P_04
                ,KEIKAKU_OH_PBS_01
                ,KEIKAKU_OH_PBS_02
                ,KEIKAKU_OH_PBS_03
                ,KEIKAKU_OH_PBS_04
                ,KEIKAKU_OH_PRE_TRIM_01
                ,KEIKAKU_OH_PRE_TRIM_02
                ,KEIKAKU_OH_PRE_TRIM_03
                ,KEIKAKU_OH_PRE_TRIM_04
                ,KEIKAKU_OH_TRIM_01
                ,KEIKAKU_OH_TRIM_02
                ,KEIKAKU_OH_TRIM_03
                ,KEIKAKU_OH_TRIM_04
                ,KEIKAKU_OH_FINAL_01
                ,KEIKAKU_OH_FINAL_02
                ,KEIKAKU_OH_FINAL_03
                ,KEIKAKU_OH_FINAL_04
                ,KEIKAKU_OH_KASOU_01
                ,KEIKAKU_OH_KASOU_02
                ,KEIKAKU_OH_KASOU_03
                ,KEIKAKU_OH_KASOU_04
                ,KEIKAKU_OH_DELIV_01
                ,KEIKAKU_OH_DELIV_02
                ,KEIKAKU_OH_DELIV_03
                ,KEIKAKU_OH_DELIV_04
                ,KEIKAKU_OH_UKEIRE_01
                ,KEIKAKU_OH_UKEIRE_02
                ,KEIKAKU_OH_UKEIRE_03
                ,KEIKAKU_OH_UKEIRE_04
                ,ROWID
              FROM SHAKEI_183
           END-EXEC.
           EXEC SQL DECLARE CR04 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN
                ,SHAKEI_CODE
                ,LINE_KUBUN
                ,SHIFT
                ,KOUTEI_ID
                ,KAISHI_JIKOKU
                ,JISSEKI_KAISHI_IZEN
                ,JISSEKI_HH_TBL
                ,JISSEKI_12H_IKOU
                ,KEIKAKU_KAISHI_IZEN
                ,KEIKAKU_HH_TBL
                ,KEIKAKU_12H_IKOU
                ,ROWID
              FROM JIKEI_184
           END-EXEC.
           EXEC SQL DECLARE CR05 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN_FILE_ID
                ,ACT_GROUP
                ,ACT_LINE_COD
                ,YYYYMM
                ,KOUTEI_KEIKAKU_ID
                ,SHIFT_DAISU_01
                ,SHIFT_DAISU_02
                ,SHIFT_DAISU_03
                ,SHIFT_DAISU_04
                ,SHIFT_DAISU_05
                ,SHIFT_DAISU_06
                ,SHIFT_DAISU_07
                ,SHIFT_DAISU_08
                ,SHIFT_DAISU_09
                ,SHIFT_DAISU_10
                ,SHIFT_DAISU_11
                ,SHIFT_DAISU_12
                ,SHIFT_DAISU_13
                ,SHIFT_DAISU_14
                ,SHIFT_DAISU_15
                ,SHIFT_DAISU_16
                ,SHIFT_DAISU_17
                ,SHIFT_DAISU_18
                ,SHIFT_DAISU_19
                ,SHIFT_DAISU_20
                ,SHIFT_DAISU_21
                ,SHIFT_DAISU_22
                ,SHIFT_DAISU_23
                ,SHIFT_DAISU_24
                ,SHIFT_DAISU_25
                ,SHIFT_DAISU_26
                ,SHIFT_DAISU_27
                ,SHIFT_DAISU_28
                ,SHIFT_DAISU_29
                ,SHIFT_DAISU_30
                ,SHIFT_DAISU_31
                ,SHIFT_DAISU_32
                ,SHIFT_DAISU_33
                ,SHIFT_DAISU_34
                ,SHIFT_DAISU_35
                ,SHIFT_DAISU_36
                ,SHIFT_DAISU_37
                ,SHIFT_DAISU_38
                ,SHIFT_DAISU_39
                ,SHIFT_DAISU_40
                ,SHIFT_DAISU_41
                ,SHIFT_DAISU_42
                ,SHIFT_DAISU_43
                ,SHIFT_DAISU_44
                ,SHIFT_DAISU_45
                ,SHIFT_DAISU_46
                ,SHIFT_DAISU_47
                ,SHIFT_DAISU_48
                ,SHIFT_DAISU_49
                ,SHIFT_DAISU_50
                ,SHIFT_DAISU_51
                ,SHIFT_DAISU_52
                ,SHIFT_DAISU_53
                ,SHIFT_DAISU_54
                ,SHIFT_DAISU_55
                ,SHIFT_DAISU_56
                ,SHIFT_DAISU_57
                ,SHIFT_DAISU_58
                ,SHIFT_DAISU_59
                ,SHIFT_DAISU_60
                ,SHIFT_DAISU_61
                ,SHIFT_DAISU_62
                ,SHIFT_DAISU_63
                ,TIME_STAMP
                ,ROWID
              FROM KOUTEI_185
           END-EXEC.
           EXEC SQL DECLARE CR06 CURSOR FOR
              SELECT
                 KOUJOU_KUBUN
                ,KOUJOU_CONTROL_NO
                ,ACT_LINE_CODE
                ,POINT2_SEQ_NO
                ,POINT3_SEQ_NO
                ,POINT4_SEQ_NO
                ,TRANSPORT_DIRECTION_SYMBOL
                ,DOUKISEISAN_SEQ_NO
                ,DELIVERY_PLAN_NON_MARGIN
                ,PRODUCTION_MONTH
                ,MS_NO
                ,ROWID
              FROM SEQUENCE_180
              ORDER BY
                 KOUJOU_KUBUN
                ,KOUJOU_CONTROL_NO
           END-EXEC.
            EXEC SQL INCLUDE SQLCA END-EXEC.
            EXEC SQL BEGIN DECLARE SECTION END-EXEC.
       01   HOST-FOR-STATUS-181.
           03 H--KOUJOU-KUBUN-181              PIC X(1).
           03 H--KOUJOU-CONTROL-NO-181         PIC X(11).
           03 H--MODEL-181                     PIC X(18).
           03 H--COLOR-181                     PIC X(3).
           03 H--UCHIBARI-181                  PIC X(1).
           03 H--EX-NO-181                     PIC X(5).
           03 H--SHIMUKECHI-181                PIC X(3).
           03 H--LINE-MAIN-181                 PIC X(1).
           03 H--LINE-METAL-181                PIC X(1).
           03 H--LINE-PAINT-181                PIC X(1).
           03 H--LINE-TRIM-181                 PIC X(1).
           03 H--KOKUYU-KUBUN-181              PIC X(1).
           03 H--KIJUN-SHAKEI-181              PIC X(5).
           03 H--DAKOKU-KATASHIKI-181          PIC X(12).
           03 H--CHASSIS-NO-181                PIC X(8).
           03 H--ENG-KATASHIKI-181             PIC X(12).
           03 H--ENG-NO-181                    PIC X(8).
           03 H--ORG-MODEL-181                 PIC X(18).
           03 H--ORG-COLOR-181                 PIC X(3).
           03 H--ORG-UCHIBARI-181              PIC X(1).
           03 H--ORG-EX-NO-181                 PIC X(5).
           03 H--ORG-LINE-KUBUN-181            PIC X(4).
           03 H--SHAKEI-CODE-181               PIC X(6).
           03 H--SHAMEI-CODE-181               PIC X(6).
           03 H--ORDER-KUBUN-181               PIC X(1).
           03 H--DEALER-NO-181                 PIC X(4).
           03 H--ORDER-NO-181                  PIC X(6).
           03 H--COMFIRMED-ORDER-NO-181        PIC X(12).
           03 H--CUSTOMER-NAME-181             PIC X(41).
           03 H--TENJI-PRY-CODE-181            PIC X(1).
           03 H--STATUS-POINT-181              PIC X(2).
           03 H--JISSEKI-JIKOKU-01-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-02-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-03-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-04-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-05-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-06-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-07-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-08-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-09-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-10-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-11-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-12-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-13-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-14-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-15-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-16-181         PIC S9(11) COMP-3.
           03 H--JISSEKI-JIKOKU-17-181         PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-01-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-02-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-03-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-04-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-05-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-06-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-07-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-08-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-09-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-10-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-11-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-12-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-13-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-14-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-15-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-16-181       PIC S9(11) COMP-3.
           03 H--ORIGINAL-KEIKAKU-17-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-01-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-02-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-03-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-04-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-05-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-06-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-07-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-08-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-09-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-10-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-11-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-12-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-13-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-14-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-15-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-16-181       PIC S9(11) COMP-3.
           03 H--REVISED2-KEIKAKU-17-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-01-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-02-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-03-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-04-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-05-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-06-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-07-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-08-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-09-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-10-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-11-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-12-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-13-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-14-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-15-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-16-181       PIC S9(11) COMP-3.
           03 H--REVISED1-KEIKAKU-17-181       PIC S9(11) COMP-3.
           03 H--IKKATSU-SYM2-01-181           PIC X(1).
           03 H--IKKATSU-SYM2-02-181           PIC X(1).
           03 H--IKKATSU-SYM2-03-181           PIC X(1).
           03 H--IKKATSU-SYM2-04-181           PIC X(1).
           03 H--IKKATSU-SYM2-05-181           PIC X(1).
           03 H--IKKATSU-SYM2-06-181           PIC X(1).
           03 H--IKKATSU-SYM2-07-181           PIC X(1).
           03 H--IKKATSU-SYM2-08-181           PIC X(1).
           03 H--IKKATSU-SYM2-09-181           PIC X(1).
           03 H--IKKATSU-SYM2-10-181           PIC X(1).
           03 H--IKKATSU-SYM2-11-181           PIC X(1).
           03 H--IKKATSU-SYM2-12-181           PIC X(1).
           03 H--IKKATSU-SYM2-13-181           PIC X(1).
           03 H--IKKATSU-SYM2-14-181           PIC X(1).
           03 H--IKKATSU-SYM2-15-181           PIC X(1).
           03 H--IKKATSU-SYM2-16-181           PIC X(1).
           03 H--IKKATSU-SYM2-17-181           PIC X(1).
           03 H--IKKATSU-SYM1-01-181           PIC X(1).
           03 H--IKKATSU-SYM1-02-181           PIC X(1).
           03 H--IKKATSU-SYM1-03-181           PIC X(1).
           03 H--IKKATSU-SYM1-04-181           PIC X(1).
           03 H--IKKATSU-SYM1-05-181           PIC X(1).
           03 H--IKKATSU-SYM1-06-181           PIC X(1).
           03 H--IKKATSU-SYM1-07-181           PIC X(1).
           03 H--IKKATSU-SYM1-08-181           PIC X(1).
           03 H--IKKATSU-SYM1-09-181           PIC X(1).
           03 H--IKKATSU-SYM1-10-181           PIC X(1).
           03 H--IKKATSU-SYM1-11-181           PIC X(1).
           03 H--IKKATSU-SYM1-12-181           PIC X(1).
           03 H--IKKATSU-SYM1-13-181           PIC X(1).
           03 H--IKKATSU-SYM1-14-181           PIC X(1).
           03 H--IKKATSU-SYM1-15-181           PIC X(1).
           03 H--IKKATSU-SYM1-16-181           PIC X(1).
           03 H--IKKATSU-SYM1-17-181           PIC X(1).
           03 H--YOTEI-INPUT-JIKOKU-01-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-02-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-03-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-04-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-05-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-06-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-07-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-08-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-09-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-10-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-11-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-12-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-13-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-14-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-15-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-16-181     PIC S9(9) COMP-3.
           03 H--YOTEI-INPUT-JIKOKU-17-181     PIC S9(9) COMP-3.
           03 H--HANEDASHI-RIYUU1-01-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-02-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-03-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-04-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-05-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-06-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-07-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-08-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-09-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-10-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-11-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-12-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-13-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-14-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-15-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-16-181       PIC X(2).
           03 H--HANEDASHI-RIYUU1-17-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-01-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-02-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-03-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-04-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-05-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-06-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-07-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-08-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-09-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-10-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-11-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-12-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-13-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-14-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-15-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-16-181       PIC X(2).
           03 H--HANEDASHI-RIYUU2-17-181       PIC X(2).
           03 H--DELIVERY-LEAD-KOTEI-181       PIC S9(5) COMP-3.
           03 H--DELIVERY-LEAD-YOYUU-181       PIC S9(5) COMP-3.
           03 H--IKANSAKI-181                  PIC X(4).
           03 H--KENSA-IKAN-SHIKIBETSU-181     PIC X(1).
           03 H--KASOUSHA-SYM-181              PIC X(1).
           03 H--KASOU-MAKER-181               PIC X(4).
           03 H--KASOU-KANRYOU-LEAD-181        PIC S9(5) COMP-3.
           03 H--TOKKI-JIKOU-181               PIC X(20).
           03 H--ACT-SCH-KEY-181               PIC X(1).
           03 H--ACT-SEQ-NO-181                PIC X(10).
           03 H--SHATAI-RE-ACT-SEQ-NO-181      PIC X(11).
           03 H--FINAL-RE-ACT-SEQ-NO-181       PIC X(11).
           03 H--TRIM-SEQ-NO-181               PIC X(6).
           03 H--OFFLINE-SEQ-NO-181            PIC X(6).
           03 H--KANKEN-YMD-181                PIC X(6).
           03 H--MS-OFFLINE-YMD-181            PIC X(10).
           03 H--SYM-TOKUSHUSHA-181            PIC X(1).
           03 H--SYM-KOUTEI-KEIKAKU-GAI-181    PIC X(1).
           03 H--SYM-ZAIKO-ZUMI-181            PIC X(1).
           03 H--SYM-GYAKUBARASHI-GAI-181      PIC X(1).
           03 H--SYM-SENKOU-MI-GAI-181         PIC X(1).
           03 H--SYM-SM-DAIHYOU-181            PIC X(1).
           03 H--SYM-SM-KOUTEI-01-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-02-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-03-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-04-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-05-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-06-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-07-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-08-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-09-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-10-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-11-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-12-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-13-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-14-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-15-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-16-181          PIC X(1).
           03 H--SYM-SM-KOUTEI-17-181          PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-01-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-02-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-03-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-04-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-05-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-06-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-07-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-08-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-09-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-10-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-11-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-12-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-13-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-14-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-15-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-16-181   PIC X(1).
           03 H--SYM-ZENGETSU-JISSEKI-17-181   PIC X(1).
           03 H--SYM-TL-METAL-181              PIC X(1).
           03 H--SYM-TL-SHITA-P-181            PIC X(1).
           03 H--SYM-TL-NAKA-P-181             PIC X(1).
           03 H--SYM-TL-PAINT-181              PIC X(1).
           03 H--SYM-TL-FINAL-181              PIC X(1).
           03 H--SYM-TL-DELIV-181              PIC X(1).
           03 H--SYM-PIPE-LINE-GAI-181         PIC X(1).
           03 H--SYM-PIPE-LINE-ZUMI-181        PIC X(1).
           03 H--SYM-KEIKAKU-MITEI-181         PIC X(1).
           03 H--SEISAN-HOUSHIKI-181           PIC X(1).
           03 H--SYM-SHISAKU-SHA-181           PIC X(1).
           03 H--SYM-GYAKU-YUNYUU-181          PIC X(1).
           03 H--HYOUJI-GENZAICHI-181          PIC X(1).
           03 H--SALES-SPEC-10-181             PIC X(10).
           03 H--LOCAL-AREA-181                PIC X(50).
           03 H--TIME-STAMP-181                PIC X(12).
           03 H--DELIV-EIGYOU-HIZUKE-181       PIC S9(11) COMP-3.
           03 H--SYM-HANEDASHI-181             PIC X(1).
           03 H--SEIHIN-KUBUN-181              PIC X(1).
           03 H--STATUS-181-R PIC X(30) VARYING.
           03 H--KOUJOU-CONTROL-NO-1-9-181     PIC X(9).
           03 H--KOUJOU-CONTROL-NO-4-9-181     PIC X(6).
           03 H--KOUJOU-CONTROL-NO-1-3-181     PIC X(3).
           03 H--MODEL-1-3-181                 PIC X(3).
           03 H--CHASSIS-NO-1-6-181            PIC X(6).
       01   HOST-FOR-SHIYOU-182.
           03 H--KOUJOU-KUBUN-182              PIC X(1).
           03 H--MODEL-182                     PIC X(18).
           03 H--COLOR-UCHIBARI-EX-182         PIC X(9).
           03 H--LINE-TRIM-182                 PIC X(1).
           03 H--KOKUYU-KUBUN-182              PIC X(1).
           03 H--YYMM-182                      PIC X(4).
           03 H--KOUTEI-ID-182                 PIC X(2).
           03 H--JISSEKI-ZENGETSU-182          PIC S9(5) COMP-3.
           03 H--JISSEKI-TOUGETSU-182          PIC X(252).
           03 H--JISSEKI-JIGETSU-182           PIC X(164).
           03 H--RUISA-ZEN-ZENGETSU-182        PIC S9(5) COMP-3.
           03 H--KEIKAKU-ZENGETSU-182          PIC S9(5) COMP-3.
           03 H--RUISA-ZENGETSU-182            PIC S9(5) COMP-3.
           03 H--KEIKAKU-TOUGETSU-182          PIC X(252).
           03 H--KEIKAKU-JIGETSU-182           PIC X(164).
           03 H--IKAN-ZENGETSU-182             PIC S9(5) COMP-3.
           03 H--IKAN-TOUGETSU-182             PIC S9(5) COMP-3.
           03 H--IKAN-JIGETSU-182              PIC S9(5) COMP-3.
           03 H--SHIKYUU-ZENGETSU-182          PIC S9(5) COMP-3.
           03 H--SHIKYUU-TOUGETSU-182          PIC S9(5) COMP-3.
           03 H--SHIKYUU-JIGETSU-182           PIC S9(5) COMP-3.
           03 H--MIKEN-ZEN-ZENGETSU-182        PIC S9(5) COMP-3.
           03 H--MIKEN-ZENGETSU-182            PIC S9(5) COMP-3.
           03 H--KANKEN-ZEN-ZENGETSU-182       PIC S9(5) COMP-3.
           03 H--KANKEN-ZENGETSU-182           PIC S9(5) COMP-3.
           03 H--SHIYOU-182-R PIC X(30) VARYING.
       01   HOST-FOR-SHAKEI-183.
           03 H--KOUJOU-KUBUN-183              PIC X(1).
           03 H--SHAKEI-CODE-183               PIC X(6).
           03 H--LINE-KUBUN-183                PIC X(4).
           03 H--YYMM-183                      PIC X(4).
           03 H--KOUTEI-ID-183                 PIC X(2).
           03 H--JISSEKI-ZENGETSU-183          PIC S9(5) COMP-3.
           03 H--JISSEKI-TOUGETSU-183          PIC X(252).
           03 H--JISSEKI-JIGETSU-183           PIC X(164).
           03 H--RUISA-ZEN-ZENGETSU-183        PIC S9(5) COMP-3.
           03 H--KEIKAKU-ZENGETSU-183          PIC S9(5) COMP-3.
           03 H--RUISA-ZENGETSU-183            PIC S9(5) COMP-3.
           03 H--KEIKAKU-TOUGETSU-183          PIC X(252).
           03 H--KEIKAKU-JIGETSU-183           PIC X(164).
           03 H--ZEN-ZEN-SHIFT-183             PIC S9(5) COMP-3.
           03 H--ZEN-SHIFT-183                 PIC S9(5) COMP-3.
           03 H--TOU-SHIFT-183                 PIC S9(5) COMP-3.
           03 H--JI-SHIFT-183                  PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL1-01-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL1-02-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL1-03-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL1-04-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL2-01-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL2-02-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL2-03-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-METAL2-04-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-WBS-01-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-WBS-02-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-WBS-03-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-WBS-04-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-SHITA-P-01-183     PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-SHITA-P-02-183     PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-SHITA-P-03-183     PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-SHITA-P-04-183     PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-NAKA-P-01-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-NAKA-P-02-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-NAKA-P-03-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-NAKA-P-04-183      PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-UWA-P-01-183       PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-UWA-P-02-183       PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-UWA-P-03-183       PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-UWA-P-04-183       PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PBS-01-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PBS-02-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PBS-03-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PBS-04-183         PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PRE-TRIM-01-183    PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PRE-TRIM-02-183    PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PRE-TRIM-03-183    PIC S9(5) COMP-3.
           03 H--JISSEKI-OH-PRE-TRIM-04-183    PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-TRIM-01-183        PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-TRIM-02-183        PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-TRIM-03-183        PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-TRIM-04-183        PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-FINAL-01-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-FINAL-02-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-FINAL-03-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-FINAL-04-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-KASOU-01-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-KASOU-02-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-KASOU-03-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-KASOU-04-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-DELIV-01-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-DELIV-02-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-DELIV-03-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-DELIV-04-183       PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-UKEIRE-01-183      PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-UKEIRE-02-183      PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-UKEIRE-03-183      PIC S9(5) COMP-3.
           03 H--JIKKEKI-OH-UKEIRE-04-183      PIC S9(5) COMP-3.
           03 H--KEIKAKU-OH-METAL1-01-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL1-02-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL1-03-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL1-04-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL2-01-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL2-02-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL2-03-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-METAL2-04-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-WBS-01-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-WBS-02-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-WBS-03-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-WBS-04-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-SHITA-P-01-183     PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-SHITA-P-02-183     PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-SHITA-P-03-183     PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-SHITA-P-04-183     PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-NAKA-P-01-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-NAKA-P-02-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-NAKA-P-03-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-NAKA-P-04-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UWA-P-01-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UWA-P-02-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UWA-P-03-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UWA-P-04-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PBS-01-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PBS-02-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PBS-03-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PBS-04-183         PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PRE-TRIM-01-183    PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PRE-TRIM-02-183    PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PRE-TRIM-03-183    PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-PRE-TRIM-04-183    PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-TRIM-01-183        PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-TRIM-02-183        PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-TRIM-03-183        PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-TRIM-04-183        PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-FINAL-01-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-FINAL-02-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-FINAL-03-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-FINAL-04-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-KASOU-01-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-KASOU-02-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-KASOU-03-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-KASOU-04-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-DELIV-01-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-DELIV-02-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-DELIV-03-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-DELIV-04-183       PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UKEIRE-01-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UKEIRE-02-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UKEIRE-03-183      PIC S9(3) COMP-3.
           03 H--KEIKAKU-OH-UKEIRE-04-183      PIC S9(3) COMP-3.
           03 H--SHAKEI-183-R PIC X(30) VARYING.
           03 H--SHAKEI-CODE-3-6-183           PIC X(4).
           03 H--SHAKEI-CODE-1-2-183           PIC X(2).
       01   HOST-FOR-JIKEI-184.
           03 H--KOUJOU-KUBUN-184              PIC X(1).
           03 H--SHAKEI-CODE-184               PIC X(6).
           03 H--LINE-KUBUN-184                PIC X(4).
           03 H--SHIFT-184                     PIC X(7).
           03 H--KOUTEI-ID-184                 PIC X(2).
           03 H--KAISHI-JIKOKU-184             PIC X(2).
           03 H--JISSEKI-KAISHI-IZEN-184       PIC S9(3) COMP-3.
           03 H--JISSEKI-HH-TBL-184            PIC X(192).
           03 H--JISSEKI-12H-IKOU-184          PIC S9(3) COMP-3.
           03 H--KEIKAKU-KAISHI-IZEN-184       PIC S9(3) COMP-3.
           03 H--KEIKAKU-HH-TBL-184            PIC X(192).
           03 H--KEIKAKU-12H-IKOU-184          PIC S9(3) COMP-3.
           03 H--JIKEI-184-R PIC X(30) VARYING.
       01   HOST-FOR-KOUTEI-185.
           03 H--KOUJOU-KUBUN-FILE-ID-185      PIC X(1).
           03 H--ACT-GROUP-185                 PIC X(1).
           03 H--ACT-LINE-COD-185              PIC X(6).
           03 H--YYYYMM-185                    PIC X(6).
           03 H--KOUTEI-KEIKAKU-ID-185         PIC X(2).
           03 H--SHIFT-DAISU-01-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-02-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-03-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-04-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-05-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-06-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-07-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-08-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-09-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-10-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-11-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-12-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-13-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-14-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-15-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-16-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-17-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-18-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-19-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-20-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-21-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-22-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-23-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-24-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-25-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-26-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-27-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-28-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-29-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-30-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-31-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-32-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-33-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-34-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-35-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-36-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-37-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-38-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-39-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-40-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-41-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-42-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-43-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-44-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-45-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-46-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-47-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-48-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-49-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-50-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-51-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-52-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-53-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-54-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-55-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-56-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-57-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-58-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-59-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-60-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-61-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-62-185            PIC S9(3) COMP-3.
           03 H--SHIFT-DAISU-63-185            PIC S9(3) COMP-3.
           03 H--TIME-STAMP-185                PIC X(12).
           03 H--KOUTEI-185-R PIC X(30) VARYING.
       01   HOST-FOR-SEQUENCE-180.
           03 H--KOUJOU-KUBUN-180              PIC X(1).
           03 H--KOUJOU-CONTROL-NO-180         PIC X(11).
           03 H--ACT-LINE-CODE-180             PIC X(6).
           03 H--POINT2-SEQ-NO-180             PIC X(13).
           03 H--POINT3-SEQ-NO-180             PIC X(13).
           03 H--POINT4-SEQ-NO-180             PIC X(13).
           03 H--TRANSPORT-DIRECTION-MLS233    PIC X(1).
           03 H--DOUKISEISAN-SEQ-NO-180        PIC X(4).
           03 H--DELIVERY-PLAN-NON-M-MLS234    PIC X(11).
           03 H--PRODUCTION-MONTH-180          PIC X(6).
           03 H--MS-NO-180                     PIC X(1).
           03 H--SEQUENCE-180-R PIC X(30) VARYING.
           03 H--KOUJOU-CONTROL-NO-1-9-180     PIC X(9).
            EXEC SQL END DECLARE SECTION END-EXEC.
003300
NewSrc 01 DCPENV.
003700   COPY DCPENV  .
003800
004200   COPY IC7ADAFL  REPLACING 'XXX999E' BY 'E62999E'
004300                                           'XXX998E' BY 'E62998E'.
004400
005800   COPY E62001FL  REPLACING ==X)== BY ==O1==.
005900
007300   COPY E62002FL  REPLACING ==X)== BY ==O2==.
007400
008800   COPY E62003FL  REPLACING ==X)== BY ==O3==.
008900
010300   COPY E62004FL  REPLACING ==X)== BY ==O4==.
010400
011850   COPY E62005DL  REPLACING ==X)== BY ==O5==.
011900
013300   COPY E62010DL  REPLACING ==X)== BY ==O6==.
013400
013800   COPY ADAFL181  REPLACING ==X181)== BY ==S1811==.
013900
014300   COPY ADAFL182  REPLACING ==X182)== BY ==S1821==.
014400
014800   COPY ADAFL183  REPLACING ==X183)== BY ==S1831==.
014900
015300   COPY ADAFL184  REPLACING ==X184)== BY ==S1841==.
015400
015800   COPY ADADL185  REPLACING ==X185)== BY ==S1851==.
015900
016300   COPY ADADL180  REPLACING ==X180)== BY ==S1801==.
016400
016800 01           WC-CON-AREA.
016900   03         W-SW-ON                   PIC  X(01)      VALUE 'Y'.
017000   03         W-SW-OFF                  PIC  X(01)      VALUE 'N'.
017100   03         C-MOP7501                 PIC  X(08)      VALUE
017200                                                       'MOP7501 '.
017210   03         C-LOK1801                 PIC  X(08)      VALUE
017220                                                       'LOK1801 '.
017230   03         C-SEQ1801                 PIC  X(08)      VALUE
017240                                                       'SEQ1801 '.
017300   03         C-LOK1811                 PIC  X(08)      VALUE
017400                                                       'LOK1811 '.
017500   03         C-SEQ1811                 PIC  X(08)      VALUE
017600                                                       'SEQ1811 '.
017700   03         C-LOK1821                 PIC  X(08)      VALUE
017800                                                       'LOK1821 '.
017900   03         C-SEQ1821                 PIC  X(08)      VALUE
018000                                                       'SEQ1821 '.
018100   03         C-LOK1831                 PIC  X(08)      VALUE
018200                                                       'LOK1831 '.
018300   03         C-SEQ1831                 PIC  X(08)      VALUE
018400                                                       'SEQ1831 '.
018500   03         C-LOK1841                 PIC  X(08)      VALUE
018600                                                       'LOK1841 '.
018700   03         C-SEQ1841                 PIC  X(08)      VALUE
018800                                                       'SEQ1841 '.
018900   03         C-LOK1851                 PIC  X(08)      VALUE
019000                                                       'LOK1851 '.
019100   03         C-SEQ1851                 PIC  X(08)      VALUE
019200                                                       'SEQ1851 '.
019300   03         C-MCL7501                 PIC  X(08)      VALUE
019400                                                       'MCL7501 '.
019600
019700
020100 01           WK-SW-AREA.
020300   03         WK-STATUS-EOF-SW          PIC  X(01).
020400     88       WK-STATUS-DB-EOF                          VALUE 'Y'.
020600   03         WK-SHIYOU-BETSU-EOF-SW    PIC  X(01).
020700     88       WK-SHIYOU-BETSU-DB-EOF                    VALUE 'Y'.
020900   03         WK-SHAKEI-BETSU-EOF-SW    PIC  X(01).
021000     88       WK-SHAKEI-BETSU-DB-EOF                    VALUE 'Y'.
021200   03         WK-JIKEI-RETSU-EOF-SW     PIC  X(01).
021300     88       WK-JIKEI-RETSU-DB-EOF                     VALUE 'Y'.
021500   03         WK-KOUTEI-KEIKAKU-EOF-SW  PIC  X(01).
021600     88       WK-KOUTEI-KEIKAKU-DB-EOF                  VALUE 'Y'.
021800   03         WK-SEQUENCE-EOF-SW        PIC  X(01).
021900     88       WK-SEQUENCE-DB-EOF                        VALUE 'Y'.
022000
022400 01           WK-CTR-AREA.
LNXADD   03         STORE-CTR                 PIC S9(04) COMP-5.
022600
023000 01  WK-AREA.
023200   03        WK-SYSIN-PARAMETER.
023300     05      FILLER                     PIC  X(04).
023500     05      WK-SYSIN                        OCCURS 6.
023600       07    WK-PARAM                   PIC  X(03).
023700       07    FILLER                     PIC  X(01).
023800     05      FILLER                     PIC  X(56).
024000   03        WK-PARAMETER-TABLE         VALUE  SPACE.
024100     05      WK-STATUS                  PIC  X(03).
024200     05      WK-SHIYOU-BETSU            PIC  X(03).
024300     05      WK-SHAKEI-BETSU            PIC  X(03).
024400     05      WK-JIKEI-RETSU             PIC  X(03).
024500     05      WK-KOUTEI-KEIKAKU          PIC  X(03).
024600     05      WK-SEQUENCE                PIC  X(03).
024700
024800   03        WK-MODEL.
024900     05      WK-KATASHIKI               PIC  X(07).
025000     05      WK-KIHON                   PIC  X(03).
025100     05      WK-KUBUN                   PIC  X(08).
025300
025500
032600 01  CONS-AREA.
032700   03  C-CONNECT                      PIC  X(08) VALUE 'CONNECT '.
032800   03  C-DBCLOSE                      PIC  X(08) VALUE 'DBCLOSE '.
032900   03  C-OPENCR01                     PIC  X(08) VALUE 'OPENCR01'.
033000   03  C-OPENCR02                     PIC  X(08) VALUE 'OPENCR02'.
033100   03  C-OPENCR03                     PIC  X(08) VALUE 'OPENCR03'.
033200   03  C-OPENCR04                     PIC  X(08) VALUE 'OPENCR04'.
033300   03  C-OPENCR05                     PIC  X(08) VALUE 'OPENCR05'.
033400   03  C-OPENCR06                     PIC  X(08) VALUE 'OPENCR06'.
033500   03  C-FETHCR01                     PIC  X(08) VALUE 'FETHCR01'.
033600   03  C-FETHCR02                     PIC  X(08) VALUE 'FETHCR02'.
033700   03  C-FETHCR03                     PIC  X(08) VALUE 'FETHCR03'.
033800   03  C-FETHCR04                     PIC  X(08) VALUE 'FETHCR04'.
033900   03  C-FETHCR05                     PIC  X(08) VALUE 'FETHCR05'.
034000   03  C-FETHCR06                     PIC  X(08) VALUE 'FETHCR06'.
034100   03  C-CLOSCR01                     PIC  X(08) VALUE 'CLOSCR01'.
034200   03  C-CLOSCR02                     PIC  X(08) VALUE 'CLOSCR02'.
034300   03  C-CLOSCR03                     PIC  X(08) VALUE 'CLOSCR03'.
034400   03  C-CLOSCR04                     PIC  X(08) VALUE 'CLOSCR04'.
034500   03  C-CLOSCR05                     PIC  X(08) VALUE 'CLOSCR05'.
034600   03  C-CLOSCR06                     PIC  X(08) VALUE 'CLOSCR05'.
LNXADD COPY  IC7SUB01_cpy.
PROCS  PROCEDURE DIVISION .
           MOVE 0 TO RESPONSE-CODEOPN.
PROCS      OPEN INPUT MLS-SYSIN.
034900
035300
035400 OPICS-SHARYOU-DB-DUMP-SHORI.
035500     PERFORM  KAISHI-SHORI.
035600     PERFORM  STATUS-DB-DUMP-SHORI.
035700     PERFORM  SHIYOU-BETSU-DB-DUMP-SHORI.
035800     PERFORM  SHAKEI-BETSU-DB-DUMP-SHORI.
035900     PERFORM  JIKEI-RETSU-DB-DUMP-SHORI.
036000     PERFORM  KOUTEI-KEIKAKU-DB-DUMP-SHORI.
036100     PERFORM  SEQUENCE-DB-DUMP-SHORI.
036200     PERFORM  SHURYO-SHORI.
           CLOSE MLS-SYSIN
           EXIT PROGRAM.
036800
036900 KAISHI-SHORI.
           READ MLS-SYSIN INTO WK-SYSIN-PARAMETER .
037100     MOVE      1  TO  STORE-CTR.
037200     PERFORM   PARAMETER-SAKUSEI-LOOP
037300                                 UNTIL  STORE-CTR  >  5.
037700     PERFORM  CONNECT-SHORI.
038800 PARAMETER-SAKUSEI-LOOP.
038900     IF  NOT  WK-PARAM(STORE-CTR)  =  SPACE
039000       IF  WK-PARAM(STORE-CTR)  =  '181'
039100         MOVE  '181'  TO  WK-STATUS
039200       ELSE
039300         IF  WK-PARAM(STORE-CTR)  =  '182'
039400           MOVE  '182'  TO  WK-SHIYOU-BETSU
039500         ELSE
039600           IF  WK-PARAM(STORE-CTR)  =  '183'
039700             MOVE  '183'  TO  WK-SHAKEI-BETSU
039800           ELSE
039900             IF  WK-PARAM(STORE-CTR)  =  '184'
040000               MOVE  '184'  TO  WK-JIKEI-RETSU
040100             ELSE
040200               IF  WK-PARAM(STORE-CTR)  =  '185'
040300                 MOVE  '185'  TO  WK-KOUTEI-KEIKAKU
040500               ELSE
040600                 IF  WK-PARAM(STORE-CTR)  =  '180'
040700                   MOVE  '180'  TO  WK-SEQUENCE
040800                 END-IF
040900     END-IF.
041000     ADD  1  TO  STORE-CTR.
041100
041600
041700 STATUS-DB-DUMP-SHORI.
041800     IF  NOT  WK-STATUS  =  SPACE
              OPEN OUTPUT O1A-STATUS-FL
042000       MOVE     W-SW-OFF  TO  WK-STATUS-EOF-SW
042100       PERFORM  STATUS-DB-LOCATE-SHORI
042200       PERFORM  STATUS-DB-INPUT-SHORI
042300       PERFORM  STATUS-DB-DUMP-LOOP
042400                               UNTIL  WK-STATUS-DB-EOF
              CLOSE O1A-STATUS-FL
042600     END-IF.
042800 STATUS-DB-DUMP-LOOP.
042900       PERFORM  STATUS-FL-HENSHU-OUT-SHORI.
043000       PERFORM  STATUS-DB-INPUT-SHORI.
043500
043600 STATUS-DB-LOCATE-SHORI.
043800     PERFORM  181-CLOSCR01-SHORI
043900     PERFORM  181-OPENCR01-SHORI.
045200
045300 STATUS-DB-INPUT-SHORI.
045500     PERFORM  181-FETHCR01-SHORI
045900     IF  ADA-READ-NORMAL
046000       THEN
046100         IF  ADA-EOF-1
046200           THEN
046300             MOVE  W-SW-ON  TO  WK-STATUS-EOF-SW
046400         ELSE
046500           NEXT  SENTENCE .
047400
047500 STATUS-FL-HENSHU-OUT-SHORI.
047600     INITIALIZE     O1A-STATUS-REC.
047700     MOVE  S1811-AREA                  TO  O1A-STATUS-REC.
047800     MOVE  S1811-MODEL-KIHON           TO  WK-KIHON.
047900     MOVE  S1811-MODEL-KATASHIKI       TO  WK-KATASHIKI.
048000     MOVE  S1811-MODEL-KUBUN           TO  WK-KUBUN.
048100     MOVE  WK-MODEL                    TO  O1A-MODEL.
048200     MOVE  S1811-ORG-KATASHIKI         TO  WK-KATASHIKI.
048300     MOVE  S1811-ORG-KIHON             TO  WK-KIHON.
048400     MOVE  S1811-ORG-KUBUN             TO  WK-KUBUN.
048500     MOVE  WK-MODEL                    TO  O1A-ORG-MODEL.
            WRITE SYS031-REC
                  FROM O1A-STATUS-REC.
049200
049300 SHIYOU-BETSU-DB-DUMP-SHORI.
049400     IF  NOT  WK-SHIYOU-BETSU  =  SPACE
              OPEN OUTPUT O2A-SHIYOU-BETSU-FL
049600       MOVE     W-SW-OFF  TO  WK-SHIYOU-BETSU-EOF-SW
049700       PERFORM  SHIYOU-BETSU-DB-LOCATE-SHORI
049800       PERFORM  SHIYOU-BETSU-DB-INPUT-SHORI
049900       PERFORM  SHIYOU-BETSU-DB-DUMP-LOOP
050000                               UNTIL  WK-SHIYOU-BETSU-DB-EOF
              CLOSE O2A-SHIYOU-BETSU-FL
050200     END-IF.
050400 SHIYOU-BETSU-DB-DUMP-LOOP.
050500       PERFORM  SHIYOU-BETSU-HENSHU-OUT-SHORI.
050600       PERFORM  SHIYOU-BETSU-DB-INPUT-SHORI.
051100
051200 SHIYOU-BETSU-DB-LOCATE-SHORI.
051400     PERFORM  182-CLOSCR02-SHORI
051500     PERFORM  182-OPENCR02-SHORI .
052800
052900 SHIYOU-BETSU-DB-INPUT-SHORI.
053100     PERFORM  182-FETHCR02-SHORI
053500     IF  ADA-READ-NORMAL
053600       THEN
053700         IF  ADA-EOF-1
053800           THEN
053900             MOVE  W-SW-ON  TO  WK-SHIYOU-BETSU-EOF-SW
054000         ELSE
054100           NEXT  SENTENCE .
055000
055100 SHIYOU-BETSU-HENSHU-OUT-SHORI.
055200     INITIALIZE     O2A-SHIYOU-BETSU-REC.
055300     MOVE  S1821-MODEL-KIHON           TO  WK-KIHON.
055400     MOVE  S1821-MODEL-KATASHIKI       TO  WK-KATASHIKI.
055500     MOVE  S1821-MODEL-KUBUN           TO  WK-KUBUN.
055600     MOVE  WK-MODEL                    TO  O2A-MODEL.
055700     MOVE  S1821-KOUJOU-KUBUN          TO  O2A-KOUJOU-KUBUN.
055800     MOVE  S1821-COLOR-UCHIBARI-EX     TO  O2A-COLOR-UCHIBARI-EX.
055900     MOVE  S1821-LINE-TRIM             TO  O2A-LINE-TRIM.
056000     MOVE  S1821-KOKUYU-KUBUN          TO  O2A-KOKUYU-KUBUN.
056100     MOVE  S1821-YYMM                  TO  O2A-YYMM.
056200     MOVE  S1821-KOUTEI-ID             TO  O2A-KOUTEI-ID.
056300     MOVE  S1821-JISSEKI               TO  O2A-JISSEKI.
056400     MOVE  S1821-KEIKAKU               TO  O2A-KEIKAKU.
056500     MOVE  S1821-IKAN                  TO  O2A-IKAN.
056600     MOVE  S1821-SHIKYUU               TO  O2A-SHIKYUU.
056700     MOVE  S1821-MIKEN-ZAIKO           TO  O2A-MIKEN-ZAIKO.
056800     MOVE  S1821-KANKEN-ZAIKO          TO  O2A-KANKEN-ZAIKO.
            WRITE SYS032-REC
                  FROM O2A-SHIYOU-BETSU-REC.
057500
057600 SHAKEI-BETSU-DB-DUMP-SHORI.
057700     IF  NOT  WK-SHAKEI-BETSU  =  SPACE
              OPEN OUTPUT O3A-SHAKEI-BETSU-FL
057900       MOVE     W-SW-OFF  TO  WK-SHAKEI-BETSU-EOF-SW
058000       PERFORM  SHAKEI-BETSU-DB-LOCATE-SHORI
058100       PERFORM  SHAKEI-BETSU-DB-INPUT-SHORI
058200       PERFORM  SHAKEI-BETSU-DB-DUMP-LOOP
058300                               UNTIL  WK-SHAKEI-BETSU-DB-EOF
              CLOSE O3A-SHAKEI-BETSU-FL
058500     END-IF.
058700 SHAKEI-BETSU-DB-DUMP-LOOP.
058800       PERFORM  SHAKEI-BETSU-HENSHU-OUT-SHORI.
058900       PERFORM  SHAKEI-BETSU-DB-INPUT-SHORI.
059400
059500 SHAKEI-BETSU-DB-LOCATE-SHORI.
059700     PERFORM  183-CLOSCR03-SHORI
059800     PERFORM  183-OPENCR03-SHORI.
061100
061200 SHAKEI-BETSU-DB-INPUT-SHORI.
061400     PERFORM  183-FETHCR03-SHORI
061800     IF  ADA-READ-NORMAL
061900       THEN
062000         IF  ADA-EOF-1
062100           THEN
062200             MOVE  W-SW-ON  TO  WK-SHAKEI-BETSU-EOF-SW
062300         ELSE
062400           NEXT  SENTENCE .
063300
063400 SHAKEI-BETSU-HENSHU-OUT-SHORI.
063500     INITIALIZE     O3A-SHAKEI-BETSU-REC.
063600     MOVE  S1831-AREA                  TO  O3A-SHAKEI-BETSU-REC.
            WRITE SYS033-REC
                  FROM O3A-SHAKEI-BETSU-REC.
064300
064400 JIKEI-RETSU-DB-DUMP-SHORI.
064500     IF  NOT  WK-JIKEI-RETSU  =  SPACE
              OPEN OUTPUT O4A-JIKEI-RETSU-FL
064700       MOVE     W-SW-OFF  TO  WK-JIKEI-RETSU-EOF-SW
064800       PERFORM  JIKEI-RETSU-DB-LOCATE-SHORI
064900       PERFORM  JIKEI-RETSU-DB-INPUT-SHORI
065000       PERFORM  JIKEI-RETSU-DB-DUMP-LOOP
065100                               UNTIL  WK-JIKEI-RETSU-DB-EOF
              CLOSE O4A-JIKEI-RETSU-FL
065300     END-IF.
065500 JIKEI-RETSU-DB-DUMP-LOOP.
065600       PERFORM  JIKEI-RETSU-HENSHU-OUT-SHORI.
065700       PERFORM  JIKEI-RETSU-DB-INPUT-SHORI.
066200
066300 JIKEI-RETSU-DB-LOCATE-SHORI.
066500     PERFORM  184-CLOSCR04-SHORI
066600     PERFORM  184-OPENCR04-SHORI.
067900
068000 JIKEI-RETSU-DB-INPUT-SHORI.
068200     PERFORM  184-FETHCR04-SHORI
068600     IF  ADA-READ-NORMAL
068700       THEN
068800         IF  ADA-EOF-1
068900           THEN
069000             MOVE  W-SW-ON  TO  WK-JIKEI-RETSU-EOF-SW
069100         ELSE
069200           NEXT  SENTENCE .
070100
070200 JIKEI-RETSU-HENSHU-OUT-SHORI.
070300     INITIALIZE     O4A-JIKEI-RETSU-REC.
070400     MOVE  S1841-AREA                  TO  O4A-JIKEI-RETSU-REC.
            WRITE SYS034-REC
                  FROM O4A-JIKEI-RETSU-REC.
071100
071200 KOUTEI-KEIKAKU-DB-DUMP-SHORI.
071300     IF  NOT  WK-KOUTEI-KEIKAKU  =  SPACE
              OPEN OUTPUT O5A-KOUTEI-KEIKAKU-FL
071500       MOVE     W-SW-OFF  TO  WK-KOUTEI-KEIKAKU-EOF-SW
071600       PERFORM  KOUTEI-KEIKAKU-DB-LOCATE-SHORI
071700       PERFORM  KOUTEI-KEIKAKU-DB-INPUT-SHORI
071800       PERFORM  KOUTEI-KEIKAKU-DB-DUMP-LOOP
071900                               UNTIL  WK-KOUTEI-KEIKAKU-DB-EOF
              CLOSE O5A-KOUTEI-KEIKAKU-FL
072100     END-IF.
072300 KOUTEI-KEIKAKU-DB-DUMP-LOOP.
072400       PERFORM  KOUTEIKEIKAKU-HENSHU-OUT-SHORI.
072500       PERFORM  KOUTEI-KEIKAKU-DB-INPUT-SHORI.
073000
073100 KOUTEI-KEIKAKU-DB-LOCATE-SHORI.
073300     PERFORM  185-CLOSCR05-SHORI
073400     PERFORM  185-OPENCR05-SHORI.
074700
074800 KOUTEI-KEIKAKU-DB-INPUT-SHORI.
075000     PERFORM  185-FETHCR05-SHORI
075400     IF  ADA-READ-NORMAL
075500       THEN
075600         IF  ADA-EOF-1
075700           THEN
075800             MOVE  W-SW-ON  TO  WK-KOUTEI-KEIKAKU-EOF-SW
075900         ELSE
076000           NEXT  SENTENCE .
076900
077000 KOUTEIKEIKAKU-HENSHU-OUT-SHORI.
077100     INITIALIZE     O5A-KOUTEI-KEIKAKU-REC.
077200     MOVE  S1851-AREA      TO  O5A-KOUTEI-KEIKAKU-REC.
            WRITE SYS035-REC
                  FROM O5A-KOUTEI-KEIKAKU-REC.
077900
078000 SEQUENCE-DB-DUMP-SHORI.
078100     IF  NOT  WK-SEQUENCE  =  SPACE
              OPEN OUTPUT O6A-SEQUENCE-FL
078300       MOVE     W-SW-OFF  TO  WK-SEQUENCE-EOF-SW
078400       PERFORM  SEQUENCE-DB-LOCATE-SHORI
078500       PERFORM  SEQUENCE-DB-INPUT-SHORI
078600       PERFORM  SEQUENCE-DB-DUMP-LOOP
078700                               UNTIL  WK-SEQUENCE-DB-EOF
              CLOSE O6A-SEQUENCE-FL
078900     END-IF.
079100 SEQUENCE-DB-DUMP-LOOP.
079200       PERFORM  SEQUENCE-HENSHU-OUT-SHORI.
079300       PERFORM  SEQUENCE-DB-INPUT-SHORI.
079800
079900 SEQUENCE-DB-LOCATE-SHORI.
080100     PERFORM  180-CLOSCR06-SHORI
080200     PERFORM  180-OPENCR06-SHORI.
081500
081600 SEQUENCE-DB-INPUT-SHORI.
081800     PERFORM  180-FETHCR06-SHORI
082200     IF  ADA-READ-NORMAL
082300       THEN
082400         IF  ADA-EOF-1
082500           THEN
082600             MOVE  W-SW-ON  TO  WK-SEQUENCE-EOF-SW
082700         ELSE
082800           NEXT  SENTENCE .
083700
083800 SEQUENCE-HENSHU-OUT-SHORI.
083900     INITIALIZE     O6A-SEQUENCE-REC.
084000     MOVE  S1801-AREA      TO  O6A-SEQUENCE-REC.
            WRITE SYS036-REC
                  FROM O6A-SEQUENCE-REC.
084700
084800 SHURYO-SHORI.
085000     PERFORM  DB-CLOSE-SHORI .
086800 CONNECT-SHORI.
087800     MOVE  RESPONSE-CODEOPN       TO  ADA-RSP.
087900     IF  NOT  ADA-NORMAL-RSP
088000         MOVE  C-CONNECT          TO  COMMAND-CODE
088100         PERFORM  ADABAS-ERROR-SHORI
088200     END-IF.
088700 181-CLOSCR01-SHORI.
           PERFORM CLOSE-CR01
              THRU E-CLOSE-CR01
089100     MOVE  RESPONSE-CODECR01      TO  ADA-RSP.
089200     IF  NOT  ADA-NORMAL-RSP
089300         MOVE  C-CLOSCR01         TO  COMMAND-CODE
089400         PERFORM  ADABAS-ERROR-SHORI
089500     END-IF.
090000 181-OPENCR01-SHORI.
           PERFORM OPEN-CR01
              THRU E-OPEN-CR01
090400     MOVE  RESPONSE-CODECR01      TO  ADA-RSP.
090500     IF  NOT  ADA-NORMAL-RSP
090600         MOVE  C-OPENCR01         TO  COMMAND-CODE
090700         PERFORM  ADABAS-ERROR-SHORI
090800     END-IF.
091300 181-FETHCR01-SHORI.
           PERFORM FETCH-CR01
              THRU E-FETCH-CR01
091700     MOVE  RESPONSE-CODECR01      TO  ADA-RSP.
091800     IF  NOT  ADA-READ-NORMAL
091900         MOVE  C-FETHCR01         TO  COMMAND-CODE
092000         PERFORM  ADABAS-ERROR-SHORI
092100     END-IF.
092200     MOVE  RECORD-BUFCR01         TO  S1811-AREA.
092700 182-CLOSCR02-SHORI.
           PERFORM CLOSE-CR02
              THRU E-CLOSE-CR02
093100     MOVE  RESPONSE-CODECR02      TO  ADA-RSP.
093200     IF  NOT  ADA-NORMAL-RSP
093300         MOVE  C-CLOSCR02         TO  COMMAND-CODE
093400         PERFORM  ADABAS-ERROR-SHORI
093500     END-IF.
094000 182-OPENCR02-SHORI.
           PERFORM OPEN-CR02
              THRU E-OPEN-CR02
094400     MOVE  RESPONSE-CODECR02      TO  ADA-RSP.
094500     IF  NOT  ADA-NORMAL-RSP
094600         MOVE  C-OPENCR02         TO  COMMAND-CODE
094700         PERFORM  ADABAS-ERROR-SHORI
094800     END-IF.
095300 182-FETHCR02-SHORI.
           PERFORM FETCH-CR02
              THRU E-FETCH-CR02
095700     MOVE  RESPONSE-CODECR02      TO  ADA-RSP.
095800     IF  NOT  ADA-READ-NORMAL
095900         MOVE  C-FETHCR02         TO  COMMAND-CODE
096000         PERFORM  ADABAS-ERROR-SHORI
096100     END-IF.
096200     MOVE  RECORD-BUFCR02         TO  S1821-AREA.
096700 183-CLOSCR03-SHORI.
           PERFORM CLOSE-CR03
              THRU E-CLOSE-CR03
097100     MOVE  RESPONSE-CODECR03      TO  ADA-RSP.
097200     IF  NOT  ADA-NORMAL-RSP
097300         MOVE  C-CLOSCR03         TO  COMMAND-CODE
097400         PERFORM  ADABAS-ERROR-SHORI
097500     END-IF.
098000 183-OPENCR03-SHORI.
           PERFORM OPEN-CR03
              THRU E-OPEN-CR03
098400     MOVE  RESPONSE-CODECR03      TO  ADA-RSP.
098500     IF  NOT  ADA-NORMAL-RSP
098600         MOVE  C-OPENCR03         TO  COMMAND-CODE
098700         PERFORM  ADABAS-ERROR-SHORI
098800     END-IF.
099300 183-FETHCR03-SHORI.
           PERFORM FETCH-CR03
              THRU E-FETCH-CR03
099700     MOVE  RESPONSE-CODECR03      TO  ADA-RSP.
099800     IF  NOT  ADA-READ-NORMAL
099900         MOVE  C-FETHCR03         TO  COMMAND-CODE
100000         PERFORM  ADABAS-ERROR-SHORI
100100     END-IF.
100200     MOVE  RECORD-BUFCR03         TO  S1831-AREA.
100700 184-CLOSCR04-SHORI.
           PERFORM CLOSE-CR04
              THRU E-CLOSE-CR04
101100     MOVE  RESPONSE-CODECR04      TO  ADA-RSP.
101200     IF  NOT  ADA-NORMAL-RSP
101300         MOVE  C-CLOSCR04         TO  COMMAND-CODE
101400         PERFORM  ADABAS-ERROR-SHORI
101500     END-IF.
102000 184-OPENCR04-SHORI.
           PERFORM OPEN-CR04
              THRU E-OPEN-CR04
102400     MOVE  RESPONSE-CODECR04      TO  ADA-RSP.
102500     IF  NOT  ADA-NORMAL-RSP
102600         MOVE  C-OPENCR04         TO  COMMAND-CODE
102700         PERFORM  ADABAS-ERROR-SHORI
102800     END-IF.
103300 184-FETHCR04-SHORI.
           PERFORM FETCH-CR04
              THRU E-FETCH-CR04
103700     MOVE  RESPONSE-CODECR04      TO  ADA-RSP.
103800     IF  NOT  ADA-READ-NORMAL
103900         MOVE  C-FETHCR04         TO  COMMAND-CODE
104000         PERFORM  ADABAS-ERROR-SHORI
104100     END-IF.
104200     MOVE  RECORD-BUFCR04         TO  S1841-AREA.
104700 185-CLOSCR05-SHORI.
           PERFORM CLOSE-CR05
              THRU E-CLOSE-CR05
105100     MOVE  RESPONSE-CODECR05      TO  ADA-RSP.
105200     IF  NOT  ADA-NORMAL-RSP
105300         MOVE  C-CLOSCR05         TO  COMMAND-CODE
105400         PERFORM  ADABAS-ERROR-SHORI
105500     END-IF.
106000 185-OPENCR05-SHORI.
           PERFORM OPEN-CR05
              THRU E-OPEN-CR05
106400     MOVE  RESPONSE-CODECR05      TO  ADA-RSP.
106500     IF  NOT  ADA-NORMAL-RSP
106600         MOVE  C-OPENCR05         TO  COMMAND-CODE
106700         PERFORM  ADABAS-ERROR-SHORI
106800     END-IF.
107300 185-FETHCR05-SHORI.
           PERFORM FETCH-CR05
              THRU E-FETCH-CR05
107700     MOVE  RESPONSE-CODECR05      TO  ADA-RSP.
107800     IF  NOT  ADA-READ-NORMAL
107900         MOVE  C-FETHCR05         TO  COMMAND-CODE
108000         PERFORM  ADABAS-ERROR-SHORI
108100     END-IF.
108200     MOVE  RECORD-BUFCR05         TO  S1851-AREA.
108700 180-CLOSCR06-SHORI.
           PERFORM CLOSE-CR06
              THRU E-CLOSE-CR06
109100     MOVE  RESPONSE-CODECR06      TO  ADA-RSP.
109200     IF  NOT  ADA-NORMAL-RSP
109300         MOVE  C-CLOSCR06         TO  COMMAND-CODE
109400         PERFORM  ADABAS-ERROR-SHORI
109500     END-IF.
110000 180-OPENCR06-SHORI.
           PERFORM OPEN-CR06
              THRU E-OPEN-CR06
110400     MOVE  RESPONSE-CODECR06      TO  ADA-RSP.
110500     IF  NOT  ADA-NORMAL-RSP
110600         MOVE  C-OPENCR06         TO  COMMAND-CODE
110700         PERFORM  ADABAS-ERROR-SHORI
110800     END-IF.
111300 180-FETHCR06-SHORI.
           PERFORM FETCH-CR06
              THRU E-FETCH-CR06
111700     MOVE  RESPONSE-CODECR06      TO  ADA-RSP.
111800     IF  NOT  ADA-READ-NORMAL
111900         MOVE  C-FETHCR06         TO  COMMAND-CODE
112000         PERFORM  ADABAS-ERROR-SHORI
112100     END-IF.
112200     MOVE  RECORD-BUFCR06         TO  S1801-AREA.
112700 DB-CLOSE-SHORI.
113100     MOVE  RESPONSE-CODEOPN       TO  ADA-RSP.
113200     IF  NOT  ADA-NORMAL-RSP
113300         MOVE  C-DBCLOSE          TO  COMMAND-CODE
113400         PERFORM  ADABAS-ERROR-SHORI
113500     END-IF.
114000 ADABAS-ERROR-SHORI.
NCS        MOVE  SQLCODE                TO  EDIT-ERR-CODE.
114400     CALL  'IC7SUB01'          USING  ADA-ERR-MSG
114500                                      COMMAND-CODE
LNXADD                                      EDIT-ERR-CODE
LNXADD                                      WK-IC7SUB01-LINK4
LNXADD                                      WK-IC7SUB01-LINK5.
114700
       OPEN-CR01.
             IF CR01-OPENED = "Y"
                EXEC SQL CLOSE CR01 END-EXEC
             END-IF.
             MOVE "Y" TO CR01-OPENED.
             EXEC SQL OPEN   CR01             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR01
                                       SQLCODE.
       E-OPEN-CR01.
             EXIT.
       FETCH-CR01.
             EXEC SQL FETCH CR01 INTO
                 :H--KOUJOU-KUBUN-181
                ,:H--KOUJOU-CONTROL-NO-181
                ,:H--MODEL-181
                ,:H--COLOR-181
                ,:H--UCHIBARI-181
                ,:H--EX-NO-181
                ,:H--SHIMUKECHI-181
                ,:H--LINE-MAIN-181
                ,:H--LINE-METAL-181
                ,:H--LINE-PAINT-181
                ,:H--LINE-TRIM-181
                ,:H--KOKUYU-KUBUN-181
                ,:H--KIJUN-SHAKEI-181
                ,:H--DAKOKU-KATASHIKI-181
                ,:H--CHASSIS-NO-181
                ,:H--ENG-KATASHIKI-181
                ,:H--ENG-NO-181
                ,:H--ORG-MODEL-181
                ,:H--ORG-COLOR-181
                ,:H--ORG-UCHIBARI-181
                ,:H--ORG-EX-NO-181
                ,:H--ORG-LINE-KUBUN-181
                ,:H--SHAKEI-CODE-181
                ,:H--SHAMEI-CODE-181
                ,:H--ORDER-KUBUN-181
                ,:H--DEALER-NO-181
                ,:H--ORDER-NO-181
                ,:H--COMFIRMED-ORDER-NO-181
                ,:H--CUSTOMER-NAME-181
                ,:H--TENJI-PRY-CODE-181
                ,:H--STATUS-POINT-181
                ,:H--JISSEKI-JIKOKU-01-181
                ,:H--JISSEKI-JIKOKU-02-181
                ,:H--JISSEKI-JIKOKU-03-181
                ,:H--JISSEKI-JIKOKU-04-181
                ,:H--JISSEKI-JIKOKU-05-181
                ,:H--JISSEKI-JIKOKU-06-181
                ,:H--JISSEKI-JIKOKU-07-181
                ,:H--JISSEKI-JIKOKU-08-181
                ,:H--JISSEKI-JIKOKU-09-181
                ,:H--JISSEKI-JIKOKU-10-181
                ,:H--JISSEKI-JIKOKU-11-181
                ,:H--JISSEKI-JIKOKU-12-181
                ,:H--JISSEKI-JIKOKU-13-181
                ,:H--JISSEKI-JIKOKU-14-181
                ,:H--JISSEKI-JIKOKU-15-181
                ,:H--JISSEKI-JIKOKU-16-181
                ,:H--JISSEKI-JIKOKU-17-181
                ,:H--ORIGINAL-KEIKAKU-01-181
                ,:H--ORIGINAL-KEIKAKU-02-181
                ,:H--ORIGINAL-KEIKAKU-03-181
                ,:H--ORIGINAL-KEIKAKU-04-181
                ,:H--ORIGINAL-KEIKAKU-05-181
                ,:H--ORIGINAL-KEIKAKU-06-181
                ,:H--ORIGINAL-KEIKAKU-07-181
                ,:H--ORIGINAL-KEIKAKU-08-181
                ,:H--ORIGINAL-KEIKAKU-09-181
                ,:H--ORIGINAL-KEIKAKU-10-181
                ,:H--ORIGINAL-KEIKAKU-11-181
                ,:H--ORIGINAL-KEIKAKU-12-181
                ,:H--ORIGINAL-KEIKAKU-13-181
                ,:H--ORIGINAL-KEIKAKU-14-181
                ,:H--ORIGINAL-KEIKAKU-15-181
                ,:H--ORIGINAL-KEIKAKU-16-181
                ,:H--ORIGINAL-KEIKAKU-17-181
                ,:H--REVISED2-KEIKAKU-01-181
                ,:H--REVISED2-KEIKAKU-02-181
                ,:H--REVISED2-KEIKAKU-03-181
                ,:H--REVISED2-KEIKAKU-04-181
                ,:H--REVISED2-KEIKAKU-05-181
                ,:H--REVISED2-KEIKAKU-06-181
                ,:H--REVISED2-KEIKAKU-07-181
                ,:H--REVISED2-KEIKAKU-08-181
                ,:H--REVISED2-KEIKAKU-09-181
                ,:H--REVISED2-KEIKAKU-10-181
                ,:H--REVISED2-KEIKAKU-11-181
                ,:H--REVISED2-KEIKAKU-12-181
                ,:H--REVISED2-KEIKAKU-13-181
                ,:H--REVISED2-KEIKAKU-14-181
                ,:H--REVISED2-KEIKAKU-15-181
                ,:H--REVISED2-KEIKAKU-16-181
                ,:H--REVISED2-KEIKAKU-17-181
                ,:H--REVISED1-KEIKAKU-01-181
                ,:H--REVISED1-KEIKAKU-02-181
                ,:H--REVISED1-KEIKAKU-03-181
                ,:H--REVISED1-KEIKAKU-04-181
                ,:H--REVISED1-KEIKAKU-05-181
                ,:H--REVISED1-KEIKAKU-06-181
                ,:H--REVISED1-KEIKAKU-07-181
                ,:H--REVISED1-KEIKAKU-08-181
                ,:H--REVISED1-KEIKAKU-09-181
                ,:H--REVISED1-KEIKAKU-10-181
                ,:H--REVISED1-KEIKAKU-11-181
                ,:H--REVISED1-KEIKAKU-12-181
                ,:H--REVISED1-KEIKAKU-13-181
                ,:H--REVISED1-KEIKAKU-14-181
                ,:H--REVISED1-KEIKAKU-15-181
                ,:H--REVISED1-KEIKAKU-16-181
                ,:H--REVISED1-KEIKAKU-17-181
                ,:H--IKKATSU-SYM2-01-181
                ,:H--IKKATSU-SYM2-02-181
                ,:H--IKKATSU-SYM2-03-181
                ,:H--IKKATSU-SYM2-04-181
                ,:H--IKKATSU-SYM2-05-181
                ,:H--IKKATSU-SYM2-06-181
                ,:H--IKKATSU-SYM2-07-181
                ,:H--IKKATSU-SYM2-08-181
                ,:H--IKKATSU-SYM2-09-181
                ,:H--IKKATSU-SYM2-10-181
                ,:H--IKKATSU-SYM2-11-181
                ,:H--IKKATSU-SYM2-12-181
                ,:H--IKKATSU-SYM2-13-181
                ,:H--IKKATSU-SYM2-14-181
                ,:H--IKKATSU-SYM2-15-181
                ,:H--IKKATSU-SYM2-16-181
                ,:H--IKKATSU-SYM2-17-181
                ,:H--IKKATSU-SYM1-01-181
                ,:H--IKKATSU-SYM1-02-181
                ,:H--IKKATSU-SYM1-03-181
                ,:H--IKKATSU-SYM1-04-181
                ,:H--IKKATSU-SYM1-05-181
                ,:H--IKKATSU-SYM1-06-181
                ,:H--IKKATSU-SYM1-07-181
                ,:H--IKKATSU-SYM1-08-181
                ,:H--IKKATSU-SYM1-09-181
                ,:H--IKKATSU-SYM1-10-181
                ,:H--IKKATSU-SYM1-11-181
                ,:H--IKKATSU-SYM1-12-181
                ,:H--IKKATSU-SYM1-13-181
                ,:H--IKKATSU-SYM1-14-181
                ,:H--IKKATSU-SYM1-15-181
                ,:H--IKKATSU-SYM1-16-181
                ,:H--IKKATSU-SYM1-17-181
                ,:H--YOTEI-INPUT-JIKOKU-01-181
                ,:H--YOTEI-INPUT-JIKOKU-02-181
                ,:H--YOTEI-INPUT-JIKOKU-03-181
                ,:H--YOTEI-INPUT-JIKOKU-04-181
                ,:H--YOTEI-INPUT-JIKOKU-05-181
                ,:H--YOTEI-INPUT-JIKOKU-06-181
                ,:H--YOTEI-INPUT-JIKOKU-07-181
                ,:H--YOTEI-INPUT-JIKOKU-08-181
                ,:H--YOTEI-INPUT-JIKOKU-09-181
                ,:H--YOTEI-INPUT-JIKOKU-10-181
                ,:H--YOTEI-INPUT-JIKOKU-11-181
                ,:H--YOTEI-INPUT-JIKOKU-12-181
                ,:H--YOTEI-INPUT-JIKOKU-13-181
                ,:H--YOTEI-INPUT-JIKOKU-14-181
                ,:H--YOTEI-INPUT-JIKOKU-15-181
                ,:H--YOTEI-INPUT-JIKOKU-16-181
                ,:H--YOTEI-INPUT-JIKOKU-17-181
                ,:H--HANEDASHI-RIYUU1-01-181
                ,:H--HANEDASHI-RIYUU1-02-181
                ,:H--HANEDASHI-RIYUU1-03-181
                ,:H--HANEDASHI-RIYUU1-04-181
                ,:H--HANEDASHI-RIYUU1-05-181
                ,:H--HANEDASHI-RIYUU1-06-181
                ,:H--HANEDASHI-RIYUU1-07-181
                ,:H--HANEDASHI-RIYUU1-08-181
                ,:H--HANEDASHI-RIYUU1-09-181
                ,:H--HANEDASHI-RIYUU1-10-181
                ,:H--HANEDASHI-RIYUU1-11-181
                ,:H--HANEDASHI-RIYUU1-12-181
                ,:H--HANEDASHI-RIYUU1-13-181
                ,:H--HANEDASHI-RIYUU1-14-181
                ,:H--HANEDASHI-RIYUU1-15-181
                ,:H--HANEDASHI-RIYUU1-16-181
                ,:H--HANEDASHI-RIYUU1-17-181
                ,:H--HANEDASHI-RIYUU2-01-181
                ,:H--HANEDASHI-RIYUU2-02-181
                ,:H--HANEDASHI-RIYUU2-03-181
                ,:H--HANEDASHI-RIYUU2-04-181
                ,:H--HANEDASHI-RIYUU2-05-181
                ,:H--HANEDASHI-RIYUU2-06-181
                ,:H--HANEDASHI-RIYUU2-07-181
                ,:H--HANEDASHI-RIYUU2-08-181
                ,:H--HANEDASHI-RIYUU2-09-181
                ,:H--HANEDASHI-RIYUU2-10-181
                ,:H--HANEDASHI-RIYUU2-11-181
                ,:H--HANEDASHI-RIYUU2-12-181
                ,:H--HANEDASHI-RIYUU2-13-181
                ,:H--HANEDASHI-RIYUU2-14-181
                ,:H--HANEDASHI-RIYUU2-15-181
                ,:H--HANEDASHI-RIYUU2-16-181
                ,:H--HANEDASHI-RIYUU2-17-181
                ,:H--DELIVERY-LEAD-KOTEI-181
                ,:H--DELIVERY-LEAD-YOYUU-181
                ,:H--IKANSAKI-181
                ,:H--KENSA-IKAN-SHIKIBETSU-181
                ,:H--KASOUSHA-SYM-181
                ,:H--KASOU-MAKER-181
                ,:H--KASOU-KANRYOU-LEAD-181
                ,:H--TOKKI-JIKOU-181
                ,:H--ACT-SCH-KEY-181
                ,:H--ACT-SEQ-NO-181
                ,:H--SHATAI-RE-ACT-SEQ-NO-181
                ,:H--FINAL-RE-ACT-SEQ-NO-181
                ,:H--TRIM-SEQ-NO-181
                ,:H--OFFLINE-SEQ-NO-181
                ,:H--KANKEN-YMD-181
                ,:H--MS-OFFLINE-YMD-181
                ,:H--SYM-TOKUSHUSHA-181
                ,:H--SYM-KOUTEI-KEIKAKU-GAI-181
                ,:H--SYM-ZAIKO-ZUMI-181
                ,:H--SYM-GYAKUBARASHI-GAI-181
                ,:H--SYM-SENKOU-MI-GAI-181
                ,:H--SYM-SM-DAIHYOU-181
                ,:H--SYM-SM-KOUTEI-01-181
                ,:H--SYM-SM-KOUTEI-02-181
                ,:H--SYM-SM-KOUTEI-03-181
                ,:H--SYM-SM-KOUTEI-04-181
                ,:H--SYM-SM-KOUTEI-05-181
                ,:H--SYM-SM-KOUTEI-06-181
                ,:H--SYM-SM-KOUTEI-07-181
                ,:H--SYM-SM-KOUTEI-08-181
                ,:H--SYM-SM-KOUTEI-09-181
                ,:H--SYM-SM-KOUTEI-10-181
                ,:H--SYM-SM-KOUTEI-11-181
                ,:H--SYM-SM-KOUTEI-12-181
                ,:H--SYM-SM-KOUTEI-13-181
                ,:H--SYM-SM-KOUTEI-14-181
                ,:H--SYM-SM-KOUTEI-15-181
                ,:H--SYM-SM-KOUTEI-16-181
                ,:H--SYM-SM-KOUTEI-17-181
                ,:H--SYM-ZENGETSU-JISSEKI-01-181
                ,:H--SYM-ZENGETSU-JISSEKI-02-181
                ,:H--SYM-ZENGETSU-JISSEKI-03-181
                ,:H--SYM-ZENGETSU-JISSEKI-04-181
                ,:H--SYM-ZENGETSU-JISSEKI-05-181
                ,:H--SYM-ZENGETSU-JISSEKI-06-181
                ,:H--SYM-ZENGETSU-JISSEKI-07-181
                ,:H--SYM-ZENGETSU-JISSEKI-08-181
                ,:H--SYM-ZENGETSU-JISSEKI-09-181
                ,:H--SYM-ZENGETSU-JISSEKI-10-181
                ,:H--SYM-ZENGETSU-JISSEKI-11-181
                ,:H--SYM-ZENGETSU-JISSEKI-12-181
                ,:H--SYM-ZENGETSU-JISSEKI-13-181
                ,:H--SYM-ZENGETSU-JISSEKI-14-181
                ,:H--SYM-ZENGETSU-JISSEKI-15-181
                ,:H--SYM-ZENGETSU-JISSEKI-16-181
                ,:H--SYM-ZENGETSU-JISSEKI-17-181
                ,:H--SYM-TL-METAL-181
                ,:H--SYM-TL-SHITA-P-181
                ,:H--SYM-TL-NAKA-P-181
                ,:H--SYM-TL-PAINT-181
                ,:H--SYM-TL-FINAL-181
                ,:H--SYM-TL-DELIV-181
                ,:H--SYM-PIPE-LINE-GAI-181
                ,:H--SYM-PIPE-LINE-ZUMI-181
                ,:H--SYM-KEIKAKU-MITEI-181
                ,:H--SEISAN-HOUSHIKI-181
                ,:H--SYM-SHISAKU-SHA-181
                ,:H--SYM-GYAKU-YUNYUU-181
                ,:H--HYOUJI-GENZAICHI-181
                ,:H--SALES-SPEC-10-181
                ,:H--LOCAL-AREA-181
                ,:H--TIME-STAMP-181
                ,:H--DELIV-EIGYOU-HIZUKE-181
                ,:H--SYM-HANEDASHI-181
                ,:H--SEIHIN-KUBUN-181
                ,:H--STATUS-181-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR01
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-181 TO
                    S181A-KOUJOU-KUBUN
                        OF RECORD-BUFCR01
                  MOVE  H--KOUJOU-CONTROL-NO-181 TO
                    S181A-KOUJOU-CONTROL-NO
                        OF RECORD-BUFCR01
                  MOVE  H--MODEL-181 TO
                    S181A-MODEL
                        OF RECORD-BUFCR01
                  MOVE  H--COLOR-181 TO
                    S181A-COLOR
                        OF RECORD-BUFCR01
                  MOVE  H--UCHIBARI-181 TO
                    S181A-UCHIBARI
                        OF RECORD-BUFCR01
                  MOVE  H--EX-NO-181 TO
                    S181A-EX-NO
                        OF RECORD-BUFCR01
                  MOVE  H--SHIMUKECHI-181 TO
                    S181A-SHIMUKECHI
                        OF RECORD-BUFCR01
                  MOVE  H--LINE-MAIN-181 TO
                    S181A-LINE-MAIN
                        OF RECORD-BUFCR01
                  MOVE  H--LINE-METAL-181 TO
                    S181A-LINE-METAL
                        OF RECORD-BUFCR01
                  MOVE  H--LINE-PAINT-181 TO
                    S181A-LINE-PAINT
                        OF RECORD-BUFCR01
                  MOVE  H--LINE-TRIM-181 TO
                    S181A-LINE-TRIM
                        OF RECORD-BUFCR01
                  MOVE  H--KOKUYU-KUBUN-181 TO
                    S181A-KOKUYU-KUBUN
                        OF RECORD-BUFCR01
                  MOVE  H--KIJUN-SHAKEI-181 TO
                    S181A-KIJUN-SHAKEI
                        OF RECORD-BUFCR01
                  MOVE  H--DAKOKU-KATASHIKI-181 TO
                    S181A-DAKOKU-KATASHIKI
                        OF RECORD-BUFCR01
                  MOVE  H--CHASSIS-NO-181 TO
                    S181A-CHASSIS-NO
                        OF RECORD-BUFCR01
                  MOVE  H--ENG-KATASHIKI-181 TO
                    S181A-ENG-KATASHIKI
                        OF RECORD-BUFCR01
                  MOVE  H--ENG-NO-181 TO
                    S181A-ENG-NO
                        OF RECORD-BUFCR01
                  MOVE  H--ORG-MODEL-181 TO
                    S181A-ORG-MODEL
                        OF RECORD-BUFCR01
                  MOVE  H--ORG-COLOR-181 TO
                    S181A-ORG-COLOR
                        OF RECORD-BUFCR01
                  MOVE  H--ORG-UCHIBARI-181 TO
                    S181A-ORG-UCHIBARI
                        OF RECORD-BUFCR01
                  MOVE  H--ORG-EX-NO-181 TO
                    S181A-ORG-EX-NO
                        OF RECORD-BUFCR01
                  MOVE  H--ORG-LINE-KUBUN-181 TO
                    S181A-ORG-LINE-KUBUN
                        OF RECORD-BUFCR01
                  MOVE  H--SHAKEI-CODE-181 TO
                    S181A-SHAKEI-CODE
                        OF RECORD-BUFCR01
                  MOVE  H--SHAMEI-CODE-181 TO
                    S181A-SHAMEI-CODE
                        OF RECORD-BUFCR01
                  MOVE  H--ORDER-KUBUN-181 TO
                    S181A-ORDER-KUBUN
                        OF RECORD-BUFCR01
                  MOVE  H--DEALER-NO-181 TO
                    S181A-DEALER-NO
                        OF RECORD-BUFCR01
                  MOVE  H--ORDER-NO-181 TO
                    S181A-ORDER-NO
                        OF RECORD-BUFCR01
                  MOVE  H--COMFIRMED-ORDER-NO-181 TO
                    S181A-COMFIRMED-ORDER-NO
                        OF RECORD-BUFCR01
                  MOVE  H--CUSTOMER-NAME-181 TO
                    S181A-CUSTOMER-NAME
                        OF RECORD-BUFCR01
                  MOVE  H--TENJI-PRY-CODE-181 TO
                    S181A-TENJI-PRY-CODE
                        OF RECORD-BUFCR01
                  MOVE  H--STATUS-POINT-181 TO
                    S181A-STATUS-POINT
                        OF RECORD-BUFCR01
                  MOVE  H--JISSEKI-JIKOKU-01-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(01)
                  MOVE  H--JISSEKI-JIKOKU-02-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(02)
                  MOVE  H--JISSEKI-JIKOKU-03-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(03)
                  MOVE  H--JISSEKI-JIKOKU-04-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(04)
                  MOVE  H--JISSEKI-JIKOKU-05-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(05)
                  MOVE  H--JISSEKI-JIKOKU-06-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(06)
                  MOVE  H--JISSEKI-JIKOKU-07-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(07)
                  MOVE  H--JISSEKI-JIKOKU-08-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(08)
                  MOVE  H--JISSEKI-JIKOKU-09-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(09)
                  MOVE  H--JISSEKI-JIKOKU-10-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(10)
                  MOVE  H--JISSEKI-JIKOKU-11-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(11)
                  MOVE  H--JISSEKI-JIKOKU-12-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(12)
                  MOVE  H--JISSEKI-JIKOKU-13-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(13)
                  MOVE  H--JISSEKI-JIKOKU-14-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(14)
                  MOVE  H--JISSEKI-JIKOKU-15-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(15)
                  MOVE  H--JISSEKI-JIKOKU-16-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(16)
                  MOVE  H--JISSEKI-JIKOKU-17-181 TO
                    S181A-JISSEKI-JIKOKU
                        OF RECORD-BUFCR01(17)
                  MOVE  H--ORIGINAL-KEIKAKU-01-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(01)
                  MOVE  H--ORIGINAL-KEIKAKU-02-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(02)
                  MOVE  H--ORIGINAL-KEIKAKU-03-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(03)
                  MOVE  H--ORIGINAL-KEIKAKU-04-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(04)
                  MOVE  H--ORIGINAL-KEIKAKU-05-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(05)
                  MOVE  H--ORIGINAL-KEIKAKU-06-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(06)
                  MOVE  H--ORIGINAL-KEIKAKU-07-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(07)
                  MOVE  H--ORIGINAL-KEIKAKU-08-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(08)
                  MOVE  H--ORIGINAL-KEIKAKU-09-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(09)
                  MOVE  H--ORIGINAL-KEIKAKU-10-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(10)
                  MOVE  H--ORIGINAL-KEIKAKU-11-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(11)
                  MOVE  H--ORIGINAL-KEIKAKU-12-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(12)
                  MOVE  H--ORIGINAL-KEIKAKU-13-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(13)
                  MOVE  H--ORIGINAL-KEIKAKU-14-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(14)
                  MOVE  H--ORIGINAL-KEIKAKU-15-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(15)
                  MOVE  H--ORIGINAL-KEIKAKU-16-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(16)
                  MOVE  H--ORIGINAL-KEIKAKU-17-181 TO
                    S181A-ORIGINAL-KEIKAKU
                        OF RECORD-BUFCR01(17)
                  MOVE  H--REVISED2-KEIKAKU-01-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(01)
                  MOVE  H--REVISED2-KEIKAKU-02-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(02)
                  MOVE  H--REVISED2-KEIKAKU-03-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(03)
                  MOVE  H--REVISED2-KEIKAKU-04-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(04)
                  MOVE  H--REVISED2-KEIKAKU-05-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(05)
                  MOVE  H--REVISED2-KEIKAKU-06-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(06)
                  MOVE  H--REVISED2-KEIKAKU-07-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(07)
                  MOVE  H--REVISED2-KEIKAKU-08-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(08)
                  MOVE  H--REVISED2-KEIKAKU-09-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(09)
                  MOVE  H--REVISED2-KEIKAKU-10-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(10)
                  MOVE  H--REVISED2-KEIKAKU-11-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(11)
                  MOVE  H--REVISED2-KEIKAKU-12-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(12)
                  MOVE  H--REVISED2-KEIKAKU-13-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(13)
                  MOVE  H--REVISED2-KEIKAKU-14-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(14)
                  MOVE  H--REVISED2-KEIKAKU-15-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(15)
                  MOVE  H--REVISED2-KEIKAKU-16-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(16)
                  MOVE  H--REVISED2-KEIKAKU-17-181 TO
                    S181A-REVISED2-KEIKAKU
                        OF RECORD-BUFCR01(17)
                  MOVE  H--REVISED1-KEIKAKU-01-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(01)
                  MOVE  H--REVISED1-KEIKAKU-02-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(02)
                  MOVE  H--REVISED1-KEIKAKU-03-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(03)
                  MOVE  H--REVISED1-KEIKAKU-04-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(04)
                  MOVE  H--REVISED1-KEIKAKU-05-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(05)
                  MOVE  H--REVISED1-KEIKAKU-06-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(06)
                  MOVE  H--REVISED1-KEIKAKU-07-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(07)
                  MOVE  H--REVISED1-KEIKAKU-08-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(08)
                  MOVE  H--REVISED1-KEIKAKU-09-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(09)
                  MOVE  H--REVISED1-KEIKAKU-10-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(10)
                  MOVE  H--REVISED1-KEIKAKU-11-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(11)
                  MOVE  H--REVISED1-KEIKAKU-12-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(12)
                  MOVE  H--REVISED1-KEIKAKU-13-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(13)
                  MOVE  H--REVISED1-KEIKAKU-14-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(14)
                  MOVE  H--REVISED1-KEIKAKU-15-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(15)
                  MOVE  H--REVISED1-KEIKAKU-16-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(16)
                  MOVE  H--REVISED1-KEIKAKU-17-181 TO
                    S181A-REVISED1-KEIKAKU
                        OF RECORD-BUFCR01(17)
                  MOVE  H--IKKATSU-SYM2-01-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(01)
                  MOVE  H--IKKATSU-SYM2-02-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(02)
                  MOVE  H--IKKATSU-SYM2-03-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(03)
                  MOVE  H--IKKATSU-SYM2-04-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(04)
                  MOVE  H--IKKATSU-SYM2-05-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(05)
                  MOVE  H--IKKATSU-SYM2-06-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(06)
                  MOVE  H--IKKATSU-SYM2-07-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(07)
                  MOVE  H--IKKATSU-SYM2-08-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(08)
                  MOVE  H--IKKATSU-SYM2-09-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(09)
                  MOVE  H--IKKATSU-SYM2-10-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(10)
                  MOVE  H--IKKATSU-SYM2-11-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(11)
                  MOVE  H--IKKATSU-SYM2-12-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(12)
                  MOVE  H--IKKATSU-SYM2-13-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(13)
                  MOVE  H--IKKATSU-SYM2-14-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(14)
                  MOVE  H--IKKATSU-SYM2-15-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(15)
                  MOVE  H--IKKATSU-SYM2-16-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(16)
                  MOVE  H--IKKATSU-SYM2-17-181 TO
                    S181A-IKKATSU-SYM2
                        OF RECORD-BUFCR01(17)
                  MOVE  H--IKKATSU-SYM1-01-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(01)
                  MOVE  H--IKKATSU-SYM1-02-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(02)
                  MOVE  H--IKKATSU-SYM1-03-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(03)
                  MOVE  H--IKKATSU-SYM1-04-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(04)
                  MOVE  H--IKKATSU-SYM1-05-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(05)
                  MOVE  H--IKKATSU-SYM1-06-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(06)
                  MOVE  H--IKKATSU-SYM1-07-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(07)
                  MOVE  H--IKKATSU-SYM1-08-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(08)
                  MOVE  H--IKKATSU-SYM1-09-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(09)
                  MOVE  H--IKKATSU-SYM1-10-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(10)
                  MOVE  H--IKKATSU-SYM1-11-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(11)
                  MOVE  H--IKKATSU-SYM1-12-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(12)
                  MOVE  H--IKKATSU-SYM1-13-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(13)
                  MOVE  H--IKKATSU-SYM1-14-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(14)
                  MOVE  H--IKKATSU-SYM1-15-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(15)
                  MOVE  H--IKKATSU-SYM1-16-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(16)
                  MOVE  H--IKKATSU-SYM1-17-181 TO
                    S181A-IKKATSU-SYM1
                        OF RECORD-BUFCR01(17)
                  MOVE  H--YOTEI-INPUT-JIKOKU-01-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(01)
                  MOVE  H--YOTEI-INPUT-JIKOKU-02-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(02)
                  MOVE  H--YOTEI-INPUT-JIKOKU-03-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(03)
                  MOVE  H--YOTEI-INPUT-JIKOKU-04-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(04)
                  MOVE  H--YOTEI-INPUT-JIKOKU-05-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(05)
                  MOVE  H--YOTEI-INPUT-JIKOKU-06-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(06)
                  MOVE  H--YOTEI-INPUT-JIKOKU-07-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(07)
                  MOVE  H--YOTEI-INPUT-JIKOKU-08-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(08)
                  MOVE  H--YOTEI-INPUT-JIKOKU-09-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(09)
                  MOVE  H--YOTEI-INPUT-JIKOKU-10-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(10)
                  MOVE  H--YOTEI-INPUT-JIKOKU-11-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(11)
                  MOVE  H--YOTEI-INPUT-JIKOKU-12-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(12)
                  MOVE  H--YOTEI-INPUT-JIKOKU-13-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(13)
                  MOVE  H--YOTEI-INPUT-JIKOKU-14-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(14)
                  MOVE  H--YOTEI-INPUT-JIKOKU-15-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(15)
                  MOVE  H--YOTEI-INPUT-JIKOKU-16-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(16)
                  MOVE  H--YOTEI-INPUT-JIKOKU-17-181 TO
                    S181A-YOTEI-INPUT-JIKOKU
                        OF RECORD-BUFCR01(17)
                  MOVE  H--HANEDASHI-RIYUU1-01-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(01)
                  MOVE  H--HANEDASHI-RIYUU1-02-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(02)
                  MOVE  H--HANEDASHI-RIYUU1-03-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(03)
                  MOVE  H--HANEDASHI-RIYUU1-04-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(04)
                  MOVE  H--HANEDASHI-RIYUU1-05-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(05)
                  MOVE  H--HANEDASHI-RIYUU1-06-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(06)
                  MOVE  H--HANEDASHI-RIYUU1-07-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(07)
                  MOVE  H--HANEDASHI-RIYUU1-08-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(08)
                  MOVE  H--HANEDASHI-RIYUU1-09-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(09)
                  MOVE  H--HANEDASHI-RIYUU1-10-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(10)
                  MOVE  H--HANEDASHI-RIYUU1-11-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(11)
                  MOVE  H--HANEDASHI-RIYUU1-12-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(12)
                  MOVE  H--HANEDASHI-RIYUU1-13-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(13)
                  MOVE  H--HANEDASHI-RIYUU1-14-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(14)
                  MOVE  H--HANEDASHI-RIYUU1-15-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(15)
                  MOVE  H--HANEDASHI-RIYUU1-16-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(16)
                  MOVE  H--HANEDASHI-RIYUU1-17-181 TO
                    S181A-HANEDASHI-RIYUU1
                        OF RECORD-BUFCR01(17)
                  MOVE  H--HANEDASHI-RIYUU2-01-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(01)
                  MOVE  H--HANEDASHI-RIYUU2-02-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(02)
                  MOVE  H--HANEDASHI-RIYUU2-03-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(03)
                  MOVE  H--HANEDASHI-RIYUU2-04-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(04)
                  MOVE  H--HANEDASHI-RIYUU2-05-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(05)
                  MOVE  H--HANEDASHI-RIYUU2-06-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(06)
                  MOVE  H--HANEDASHI-RIYUU2-07-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(07)
                  MOVE  H--HANEDASHI-RIYUU2-08-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(08)
                  MOVE  H--HANEDASHI-RIYUU2-09-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(09)
                  MOVE  H--HANEDASHI-RIYUU2-10-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(10)
                  MOVE  H--HANEDASHI-RIYUU2-11-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(11)
                  MOVE  H--HANEDASHI-RIYUU2-12-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(12)
                  MOVE  H--HANEDASHI-RIYUU2-13-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(13)
                  MOVE  H--HANEDASHI-RIYUU2-14-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(14)
                  MOVE  H--HANEDASHI-RIYUU2-15-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(15)
                  MOVE  H--HANEDASHI-RIYUU2-16-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(16)
                  MOVE  H--HANEDASHI-RIYUU2-17-181 TO
                    S181A-HANEDASHI-RIYUU2
                        OF RECORD-BUFCR01(17)
                  MOVE  H--DELIVERY-LEAD-KOTEI-181 TO
                    S181A-DELIVERY-LEAD-KOTEI
                        OF RECORD-BUFCR01
                  MOVE  H--DELIVERY-LEAD-YOYUU-181 TO
                    S181A-DELIVERY-LEAD-YOYUU
                        OF RECORD-BUFCR01
                  MOVE  H--IKANSAKI-181 TO
                    S181A-IKANSAKI
                        OF RECORD-BUFCR01
                  MOVE  H--KENSA-IKAN-SHIKIBETSU-181 TO
                    S181A-KENSA-IKAN-SHIKIBETSU
                        OF RECORD-BUFCR01
                  MOVE  H--KASOUSHA-SYM-181 TO
                    S181A-KASOUSHA-SYM
                        OF RECORD-BUFCR01
                  MOVE  H--KASOU-MAKER-181 TO
                    S181A-KASOU-MAKER
                        OF RECORD-BUFCR01
                  MOVE  H--KASOU-KANRYOU-LEAD-181 TO
                    S181A-KASOU-KANRYOU-LEAD
                        OF RECORD-BUFCR01
                  MOVE  H--TOKKI-JIKOU-181 TO
                    S181A-TOKKI-JIKOU
                        OF RECORD-BUFCR01
                  MOVE  H--ACT-SCH-KEY-181 TO
                    S181A-ACT-SCH-KEY
                        OF RECORD-BUFCR01
                  MOVE  H--ACT-SEQ-NO-181 TO
                    S181A-ACT-SEQ-NO
                        OF RECORD-BUFCR01
                  MOVE  H--SHATAI-RE-ACT-SEQ-NO-181 TO
                    S181A-SHATAI-RE-ACT-SEQ-NO
                        OF RECORD-BUFCR01
                  MOVE  H--FINAL-RE-ACT-SEQ-NO-181 TO
                    S181A-FINAL-RE-ACT-SEQ-NO
                        OF RECORD-BUFCR01
                  MOVE  H--TRIM-SEQ-NO-181 TO
                    S181A-TRIM-SEQ-NO
                        OF RECORD-BUFCR01
                  MOVE  H--OFFLINE-SEQ-NO-181 TO
                    S181A-OFFLINE-SEQ-NO
                        OF RECORD-BUFCR01
                  MOVE  H--KANKEN-YMD-181 TO
                    S181A-KANKEN-YMD
                        OF RECORD-BUFCR01
                  MOVE  H--MS-OFFLINE-YMD-181 TO
                    S181A-MS-OFFLINE-YMD
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TOKUSHUSHA-181 TO
                    S181A-SYM-TOKUSHUSHA
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-KOUTEI-KEIKAKU-GAI-181 TO
                    S181A-SYM-KOUTEI-KEIKAKU-GAI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-ZAIKO-ZUMI-181 TO
                    S181A-SYM-ZAIKO-ZUMI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-GYAKUBARASHI-GAI-181 TO
                    S181A-SYM-GYAKUBARASHI-GAI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-SENKOU-MI-GAI-181 TO
                    S181A-SYM-SENKOU-MI-GAI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-SM-DAIHYOU-181 TO
                    S181A-SYM-SM-DAIHYOU
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-SM-KOUTEI-01-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(01)
                  MOVE  H--SYM-SM-KOUTEI-02-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(02)
                  MOVE  H--SYM-SM-KOUTEI-03-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(03)
                  MOVE  H--SYM-SM-KOUTEI-04-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(04)
                  MOVE  H--SYM-SM-KOUTEI-05-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(05)
                  MOVE  H--SYM-SM-KOUTEI-06-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(06)
                  MOVE  H--SYM-SM-KOUTEI-07-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(07)
                  MOVE  H--SYM-SM-KOUTEI-08-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(08)
                  MOVE  H--SYM-SM-KOUTEI-09-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(09)
                  MOVE  H--SYM-SM-KOUTEI-10-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(10)
                  MOVE  H--SYM-SM-KOUTEI-11-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(11)
                  MOVE  H--SYM-SM-KOUTEI-12-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(12)
                  MOVE  H--SYM-SM-KOUTEI-13-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(13)
                  MOVE  H--SYM-SM-KOUTEI-14-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(14)
                  MOVE  H--SYM-SM-KOUTEI-15-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(15)
                  MOVE  H--SYM-SM-KOUTEI-16-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(16)
                  MOVE  H--SYM-SM-KOUTEI-17-181 TO
                    S181A-SYM-SM-KOUTEI
                        OF RECORD-BUFCR01(17)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-01-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(01)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-02-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(02)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-03-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(03)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-04-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(04)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-05-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(05)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-06-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(06)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-07-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(07)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-08-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(08)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-09-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(09)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-10-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(10)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-11-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(11)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-12-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(12)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-13-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(13)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-14-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(14)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-15-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(15)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-16-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(16)
                  MOVE  H--SYM-ZENGETSU-JISSEKI-17-181 TO
                    S181A-SYM-ZENGETSU-JISSEKI
                        OF RECORD-BUFCR01(17)
                  MOVE  H--SYM-TL-METAL-181 TO
                    S181A-SYM-TL-METAL
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TL-SHITA-P-181 TO
                    S181A-SYM-TL-SHITA-P
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TL-NAKA-P-181 TO
                    S181A-SYM-TL-NAKA-P
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TL-PAINT-181 TO
                    S181A-SYM-TL-PAINT
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TL-FINAL-181 TO
                    S181A-SYM-TL-FINAL
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-TL-DELIV-181 TO
                    S181A-SYM-TL-DELIV
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-PIPE-LINE-GAI-181 TO
                    S181A-SYM-PIPE-LINE-GAI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-PIPE-LINE-ZUMI-181 TO
                    S181A-SYM-PIPE-LINE-ZUMI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-KEIKAKU-MITEI-181 TO
                    S181A-SYM-KEIKAKU-MITEI
                        OF RECORD-BUFCR01
                  MOVE  H--SEISAN-HOUSHIKI-181 TO
                    S181A-SEISAN-HOUSHIKI
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-SHISAKU-SHA-181 TO
                    S181A-SYM-SHISAKU-SHA
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-GYAKU-YUNYUU-181 TO
                    S181A-SYM-GYAKU-YUNYUU
                        OF RECORD-BUFCR01
                  MOVE  H--HYOUJI-GENZAICHI-181 TO
                    S181A-HYOUJI-GENZAICHI
                        OF RECORD-BUFCR01
                  MOVE  H--SALES-SPEC-10-181 TO
                    S181A-SALES-SPEC-10
                        OF RECORD-BUFCR01
                  MOVE  H--LOCAL-AREA-181 TO
                    S181A-LOCAL-AREA
                        OF RECORD-BUFCR01
                  MOVE  H--TIME-STAMP-181 TO
                    S181A-TIME-STAMP
                        OF RECORD-BUFCR01
                  MOVE  H--DELIV-EIGYOU-HIZUKE-181 TO
                    S181A-DELIV-EIGYOU-HIZUKE
                        OF RECORD-BUFCR01
                  MOVE  H--SYM-HANEDASHI-181 TO
                    S181A-SYM-HANEDASHI
                        OF RECORD-BUFCR01
                  MOVE  H--SEIHIN-KUBUN-181 TO
                    S181A-SEIHIN-KUBUN
                        OF RECORD-BUFCR01
             END-IF.
       E-FETCH-CR01.
             EXIT.
       CLOSE-CR01.
             IF CR01-OPENED = "Y"
                EXEC SQL CLOSE CR01 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR01
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR01-OPENED.
       E-CLOSE-CR01.
             EXIT.
       OPEN-CR02.
             IF CR02-OPENED = "Y"
                EXEC SQL CLOSE CR02 END-EXEC
             END-IF.
             MOVE "Y" TO CR02-OPENED.
             EXEC SQL OPEN   CR02             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR02
                                       SQLCODE.
       E-OPEN-CR02.
             EXIT.
       FETCH-CR02.
             EXEC SQL FETCH CR02 INTO
                 :H--KOUJOU-KUBUN-182
                ,:H--MODEL-182
                ,:H--COLOR-UCHIBARI-EX-182
                ,:H--LINE-TRIM-182
                ,:H--KOKUYU-KUBUN-182
                ,:H--YYMM-182
                ,:H--KOUTEI-ID-182
                ,:H--JISSEKI-ZENGETSU-182
                ,:H--JISSEKI-TOUGETSU-182
                ,:H--JISSEKI-JIGETSU-182
                ,:H--RUISA-ZEN-ZENGETSU-182
                ,:H--KEIKAKU-ZENGETSU-182
                ,:H--RUISA-ZENGETSU-182
                ,:H--KEIKAKU-TOUGETSU-182
                ,:H--KEIKAKU-JIGETSU-182
                ,:H--IKAN-ZENGETSU-182
                ,:H--IKAN-TOUGETSU-182
                ,:H--IKAN-JIGETSU-182
                ,:H--SHIKYUU-ZENGETSU-182
                ,:H--SHIKYUU-TOUGETSU-182
                ,:H--SHIKYUU-JIGETSU-182
                ,:H--MIKEN-ZEN-ZENGETSU-182
                ,:H--MIKEN-ZENGETSU-182
                ,:H--KANKEN-ZEN-ZENGETSU-182
                ,:H--KANKEN-ZENGETSU-182
                ,:H--SHIYOU-182-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR02
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-182 TO
                    S182A-KOUJOU-KUBUN
                        OF RECORD-BUFCR02
                  MOVE  H--MODEL-182 TO
                    S182A-MODEL
                        OF RECORD-BUFCR02
                  MOVE  H--COLOR-UCHIBARI-EX-182 TO
                    S182A-COLOR-UCHIBARI-EX
                        OF RECORD-BUFCR02
                  MOVE  H--LINE-TRIM-182 TO
                    S182A-LINE-TRIM
                        OF RECORD-BUFCR02
                  MOVE  H--KOKUYU-KUBUN-182 TO
                    S182A-KOKUYU-KUBUN
                        OF RECORD-BUFCR02
                  MOVE  H--YYMM-182 TO
                    S182A-YYMM
                        OF RECORD-BUFCR02
                  MOVE  H--KOUTEI-ID-182 TO
                    S182A-KOUTEI-ID
                        OF RECORD-BUFCR02
                  MOVE  H--JISSEKI-ZENGETSU-182 TO
                    S182A-JISSEKI-ZENGETSU
                        OF RECORD-BUFCR02
                  CALL "PACK182"  USING H--JISSEKI-TOUGETSU-182
                        S182A-JISSEKI-TOUGETSU
                        OF RECORD-BUFCR02
                        BY VALUE 63
                  CALL "PACK182" USING  H--JISSEKI-JIGETSU-182
                    S182A-JISSEKI-JIGETSU
                        OF RECORD-BUFCR02
                        BY VALUE 41
                  MOVE  H--RUISA-ZEN-ZENGETSU-182 TO
                    S182A-RUISA-ZEN-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--KEIKAKU-ZENGETSU-182 TO
                    S182A-KEIKAKU-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--RUISA-ZENGETSU-182 TO
                    S182A-RUISA-ZENGETSU
                        OF RECORD-BUFCR02
                  CALL "PACK182"  USING H--KEIKAKU-TOUGETSU-182
                    S182A-KEIKAKU-TOUGETSU
                        OF RECORD-BUFCR02
                    BY VALUE 63
                  CALL "PACK182" USING  H--KEIKAKU-JIGETSU-182
                    S182A-KEIKAKU-JIGETSU
                        OF RECORD-BUFCR02
                    BY VALUE 41
                  MOVE  H--IKAN-ZENGETSU-182 TO
                    S182A-IKAN-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--IKAN-TOUGETSU-182 TO
                    S182A-IKAN-TOUGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--IKAN-JIGETSU-182 TO
                    S182A-IKAN-JIGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--SHIKYUU-ZENGETSU-182 TO
                    S182A-SHIKYUU-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--SHIKYUU-TOUGETSU-182 TO
                    S182A-SHIKYUU-TOUGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--SHIKYUU-JIGETSU-182 TO
                    S182A-SHIKYUU-JIGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--MIKEN-ZEN-ZENGETSU-182 TO
                    S182A-MIKEN-ZEN-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--MIKEN-ZENGETSU-182 TO
                    S182A-MIKEN-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--KANKEN-ZEN-ZENGETSU-182 TO
                    S182A-KANKEN-ZEN-ZENGETSU
                        OF RECORD-BUFCR02
                  MOVE  H--KANKEN-ZENGETSU-182 TO
                    S182A-KANKEN-ZENGETSU
                        OF RECORD-BUFCR02
             END-IF.
       E-FETCH-CR02.
             EXIT.
       CLOSE-CR02.
             IF CR02-OPENED = "Y"
                EXEC SQL CLOSE CR02 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR02
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR02-OPENED.
       E-CLOSE-CR02.
             EXIT.
       OPEN-CR03.
             IF CR03-OPENED = "Y"
                EXEC SQL CLOSE CR03 END-EXEC
             END-IF.
             MOVE "Y" TO CR03-OPENED.
             EXEC SQL OPEN   CR03             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR03
                                       SQLCODE.
       E-OPEN-CR03.
             EXIT.
       FETCH-CR03.
             EXEC SQL FETCH CR03 INTO
                 :H--KOUJOU-KUBUN-183
                ,:H--SHAKEI-CODE-183
                ,:H--LINE-KUBUN-183
                ,:H--YYMM-183
                ,:H--KOUTEI-ID-183
                ,:H--JISSEKI-ZENGETSU-183
                ,:H--JISSEKI-TOUGETSU-183
                ,:H--JISSEKI-JIGETSU-183
                ,:H--RUISA-ZEN-ZENGETSU-183
                ,:H--KEIKAKU-ZENGETSU-183
                ,:H--RUISA-ZENGETSU-183
                ,:H--KEIKAKU-TOUGETSU-183
                ,:H--KEIKAKU-JIGETSU-183
                ,:H--ZEN-ZEN-SHIFT-183
                ,:H--ZEN-SHIFT-183
                ,:H--TOU-SHIFT-183
                ,:H--JI-SHIFT-183
                ,:H--JISSEKI-OH-METAL1-01-183
                ,:H--JISSEKI-OH-METAL1-02-183
                ,:H--JISSEKI-OH-METAL1-03-183
                ,:H--JISSEKI-OH-METAL1-04-183
                ,:H--JISSEKI-OH-METAL2-01-183
                ,:H--JISSEKI-OH-METAL2-02-183
                ,:H--JISSEKI-OH-METAL2-03-183
                ,:H--JISSEKI-OH-METAL2-04-183
                ,:H--JISSEKI-OH-WBS-01-183
                ,:H--JISSEKI-OH-WBS-02-183
                ,:H--JISSEKI-OH-WBS-03-183
                ,:H--JISSEKI-OH-WBS-04-183
                ,:H--JISSEKI-OH-SHITA-P-01-183
                ,:H--JISSEKI-OH-SHITA-P-02-183
                ,:H--JISSEKI-OH-SHITA-P-03-183
                ,:H--JISSEKI-OH-SHITA-P-04-183
                ,:H--JISSEKI-OH-NAKA-P-01-183
                ,:H--JISSEKI-OH-NAKA-P-02-183
                ,:H--JISSEKI-OH-NAKA-P-03-183
                ,:H--JISSEKI-OH-NAKA-P-04-183
                ,:H--JISSEKI-OH-UWA-P-01-183
                ,:H--JISSEKI-OH-UWA-P-02-183
                ,:H--JISSEKI-OH-UWA-P-03-183
                ,:H--JISSEKI-OH-UWA-P-04-183
                ,:H--JISSEKI-OH-PBS-01-183
                ,:H--JISSEKI-OH-PBS-02-183
                ,:H--JISSEKI-OH-PBS-03-183
                ,:H--JISSEKI-OH-PBS-04-183
                ,:H--JISSEKI-OH-PRE-TRIM-01-183
                ,:H--JISSEKI-OH-PRE-TRIM-02-183
                ,:H--JISSEKI-OH-PRE-TRIM-03-183
                ,:H--JISSEKI-OH-PRE-TRIM-04-183
                ,:H--JIKKEKI-OH-TRIM-01-183
                ,:H--JIKKEKI-OH-TRIM-02-183
                ,:H--JIKKEKI-OH-TRIM-03-183
                ,:H--JIKKEKI-OH-TRIM-04-183
                ,:H--JIKKEKI-OH-FINAL-01-183
                ,:H--JIKKEKI-OH-FINAL-02-183
                ,:H--JIKKEKI-OH-FINAL-03-183
                ,:H--JIKKEKI-OH-FINAL-04-183
                ,:H--JIKKEKI-OH-KASOU-01-183
                ,:H--JIKKEKI-OH-KASOU-02-183
                ,:H--JIKKEKI-OH-KASOU-03-183
                ,:H--JIKKEKI-OH-KASOU-04-183
                ,:H--JIKKEKI-OH-DELIV-01-183
                ,:H--JIKKEKI-OH-DELIV-02-183
                ,:H--JIKKEKI-OH-DELIV-03-183
                ,:H--JIKKEKI-OH-DELIV-04-183
                ,:H--JIKKEKI-OH-UKEIRE-01-183
                ,:H--JIKKEKI-OH-UKEIRE-02-183
                ,:H--JIKKEKI-OH-UKEIRE-03-183
                ,:H--JIKKEKI-OH-UKEIRE-04-183
                ,:H--KEIKAKU-OH-METAL1-01-183
                ,:H--KEIKAKU-OH-METAL1-02-183
                ,:H--KEIKAKU-OH-METAL1-03-183
                ,:H--KEIKAKU-OH-METAL1-04-183
                ,:H--KEIKAKU-OH-METAL2-01-183
                ,:H--KEIKAKU-OH-METAL2-02-183
                ,:H--KEIKAKU-OH-METAL2-03-183
                ,:H--KEIKAKU-OH-METAL2-04-183
                ,:H--KEIKAKU-OH-WBS-01-183
                ,:H--KEIKAKU-OH-WBS-02-183
                ,:H--KEIKAKU-OH-WBS-03-183
                ,:H--KEIKAKU-OH-WBS-04-183
                ,:H--KEIKAKU-OH-SHITA-P-01-183
                ,:H--KEIKAKU-OH-SHITA-P-02-183
                ,:H--KEIKAKU-OH-SHITA-P-03-183
                ,:H--KEIKAKU-OH-SHITA-P-04-183
                ,:H--KEIKAKU-OH-NAKA-P-01-183
                ,:H--KEIKAKU-OH-NAKA-P-02-183
                ,:H--KEIKAKU-OH-NAKA-P-03-183
                ,:H--KEIKAKU-OH-NAKA-P-04-183
                ,:H--KEIKAKU-OH-UWA-P-01-183
                ,:H--KEIKAKU-OH-UWA-P-02-183
                ,:H--KEIKAKU-OH-UWA-P-03-183
                ,:H--KEIKAKU-OH-UWA-P-04-183
                ,:H--KEIKAKU-OH-PBS-01-183
                ,:H--KEIKAKU-OH-PBS-02-183
                ,:H--KEIKAKU-OH-PBS-03-183
                ,:H--KEIKAKU-OH-PBS-04-183
                ,:H--KEIKAKU-OH-PRE-TRIM-01-183
                ,:H--KEIKAKU-OH-PRE-TRIM-02-183
                ,:H--KEIKAKU-OH-PRE-TRIM-03-183
                ,:H--KEIKAKU-OH-PRE-TRIM-04-183
                ,:H--KEIKAKU-OH-TRIM-01-183
                ,:H--KEIKAKU-OH-TRIM-02-183
                ,:H--KEIKAKU-OH-TRIM-03-183
                ,:H--KEIKAKU-OH-TRIM-04-183
                ,:H--KEIKAKU-OH-FINAL-01-183
                ,:H--KEIKAKU-OH-FINAL-02-183
                ,:H--KEIKAKU-OH-FINAL-03-183
                ,:H--KEIKAKU-OH-FINAL-04-183
                ,:H--KEIKAKU-OH-KASOU-01-183
                ,:H--KEIKAKU-OH-KASOU-02-183
                ,:H--KEIKAKU-OH-KASOU-03-183
                ,:H--KEIKAKU-OH-KASOU-04-183
                ,:H--KEIKAKU-OH-DELIV-01-183
                ,:H--KEIKAKU-OH-DELIV-02-183
                ,:H--KEIKAKU-OH-DELIV-03-183
                ,:H--KEIKAKU-OH-DELIV-04-183
                ,:H--KEIKAKU-OH-UKEIRE-01-183
                ,:H--KEIKAKU-OH-UKEIRE-02-183
                ,:H--KEIKAKU-OH-UKEIRE-03-183
                ,:H--KEIKAKU-OH-UKEIRE-04-183
                ,:H--SHAKEI-183-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR03
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-183 TO
                    S183A-KOUJOU-KUBUN
                        OF RECORD-BUFCR03
                  MOVE  H--SHAKEI-CODE-183 TO
                    S183A-SHAKEI-CODE
                        OF RECORD-BUFCR03
                  MOVE  H--LINE-KUBUN-183 TO
                    S183A-LINE-KUBUN
                        OF RECORD-BUFCR03
                  MOVE  H--YYMM-183 TO
                    S183A-YYMM
                        OF RECORD-BUFCR03
                  MOVE  H--KOUTEI-ID-183 TO
                    S183A-KOUTEI-ID
                        OF RECORD-BUFCR03
                  MOVE  H--JISSEKI-ZENGETSU-183 TO
                    S183A-JISSEKI-ZENGETSU
                        OF RECORD-BUFCR03
                  CALL "PACK183" USING   H--JISSEKI-TOUGETSU-183
                    S183A-JISSEKI-TOUGETSU
                        OF RECORD-BUFCR03
                    BY VALUE 63
                  CALL "PACK183" USING   H--JISSEKI-JIGETSU-183
                    S183A-JISSEKI-JIGETSU
                        OF RECORD-BUFCR03
                    BY VALUE 41
                  MOVE  H--RUISA-ZEN-ZENGETSU-183 TO
                    S183A-RUISA-ZEN-ZENGETSU
                        OF RECORD-BUFCR03
                  MOVE  H--KEIKAKU-ZENGETSU-183 TO
                    S183A-KEIKAKU-ZENGETSU
                        OF RECORD-BUFCR03
                  MOVE  H--RUISA-ZENGETSU-183 TO
                    S183A-RUISA-ZENGETSU
                        OF RECORD-BUFCR03
                  CALL "PACK183" USING H--KEIKAKU-TOUGETSU-183
                    S183A-KEIKAKU-TOUGETSU
                        OF RECORD-BUFCR03
                    BY VALUE 63
                  CALL "PACK183" USING H--KEIKAKU-JIGETSU-183
                    S183A-KEIKAKU-JIGETSU
                        OF RECORD-BUFCR03
                    BY VALUE 41
                  MOVE  H--ZEN-ZEN-SHIFT-183 TO
                    S183A-ZEN-ZEN-SHIFT
                        OF RECORD-BUFCR03
                  MOVE  H--ZEN-SHIFT-183 TO
                    S183A-ZEN-SHIFT
                        OF RECORD-BUFCR03
                  MOVE  H--TOU-SHIFT-183 TO
                    S183A-TOU-SHIFT
                        OF RECORD-BUFCR03
                  MOVE  H--JI-SHIFT-183 TO
                    S183A-JI-SHIFT
                        OF RECORD-BUFCR03
                  MOVE  H--JISSEKI-OH-METAL1-01-183 TO
                    S183A-JISSEKI-OH-METAL1
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-METAL1-02-183 TO
                    S183A-JISSEKI-OH-METAL1
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-METAL1-03-183 TO
                    S183A-JISSEKI-OH-METAL1
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-METAL1-04-183 TO
                    S183A-JISSEKI-OH-METAL1
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-METAL2-01-183 TO
                    S183A-JISSEKI-OH-METAL2
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-METAL2-02-183 TO
                    S183A-JISSEKI-OH-METAL2
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-METAL2-03-183 TO
                    S183A-JISSEKI-OH-METAL2
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-METAL2-04-183 TO
                    S183A-JISSEKI-OH-METAL2
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-WBS-01-183 TO
                    S183A-JISSEKI-OH-WBS
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-WBS-02-183 TO
                    S183A-JISSEKI-OH-WBS
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-WBS-03-183 TO
                    S183A-JISSEKI-OH-WBS
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-WBS-04-183 TO
                    S183A-JISSEKI-OH-WBS
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-SHITA-P-01-183 TO
                    S183A-JISSEKI-OH-SHITA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-SHITA-P-02-183 TO
                    S183A-JISSEKI-OH-SHITA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-SHITA-P-03-183 TO
                    S183A-JISSEKI-OH-SHITA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-SHITA-P-04-183 TO
                    S183A-JISSEKI-OH-SHITA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-NAKA-P-01-183 TO
                    S183A-JISSEKI-OH-NAKA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-NAKA-P-02-183 TO
                    S183A-JISSEKI-OH-NAKA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-NAKA-P-03-183 TO
                    S183A-JISSEKI-OH-NAKA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-NAKA-P-04-183 TO
                    S183A-JISSEKI-OH-NAKA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-UWA-P-01-183 TO
                    S183A-JISSEKI-OH-UWA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-UWA-P-02-183 TO
                    S183A-JISSEKI-OH-UWA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-UWA-P-03-183 TO
                    S183A-JISSEKI-OH-UWA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-UWA-P-04-183 TO
                    S183A-JISSEKI-OH-UWA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-PBS-01-183 TO
                    S183A-JISSEKI-OH-PBS
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-PBS-02-183 TO
                    S183A-JISSEKI-OH-PBS
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-PBS-03-183 TO
                    S183A-JISSEKI-OH-PBS
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-PBS-04-183 TO
                    S183A-JISSEKI-OH-PBS
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JISSEKI-OH-PRE-TRIM-01-183 TO
                    S183A-JISSEKI-OH-PRE-TRIM
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JISSEKI-OH-PRE-TRIM-02-183 TO
                    S183A-JISSEKI-OH-PRE-TRIM
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JISSEKI-OH-PRE-TRIM-03-183 TO
                    S183A-JISSEKI-OH-PRE-TRIM
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JISSEKI-OH-PRE-TRIM-04-183 TO
                    S183A-JISSEKI-OH-PRE-TRIM
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JIKKEKI-OH-TRIM-01-183 TO
                    S183A-JIKKEKI-OH-TRIM
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JIKKEKI-OH-TRIM-02-183 TO
                    S183A-JIKKEKI-OH-TRIM
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JIKKEKI-OH-TRIM-03-183 TO
                    S183A-JIKKEKI-OH-TRIM
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JIKKEKI-OH-TRIM-04-183 TO
                    S183A-JIKKEKI-OH-TRIM
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JIKKEKI-OH-FINAL-01-183 TO
                    S183A-JIKKEKI-OH-FINAL
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JIKKEKI-OH-FINAL-02-183 TO
                    S183A-JIKKEKI-OH-FINAL
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JIKKEKI-OH-FINAL-03-183 TO
                    S183A-JIKKEKI-OH-FINAL
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JIKKEKI-OH-FINAL-04-183 TO
                    S183A-JIKKEKI-OH-FINAL
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JIKKEKI-OH-KASOU-01-183 TO
                    S183A-JIKKEKI-OH-KASOU
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JIKKEKI-OH-KASOU-02-183 TO
                    S183A-JIKKEKI-OH-KASOU
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JIKKEKI-OH-KASOU-03-183 TO
                    S183A-JIKKEKI-OH-KASOU
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JIKKEKI-OH-KASOU-04-183 TO
                    S183A-JIKKEKI-OH-KASOU
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JIKKEKI-OH-DELIV-01-183 TO
                    S183A-JIKKEKI-OH-DELIV
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JIKKEKI-OH-DELIV-02-183 TO
                    S183A-JIKKEKI-OH-DELIV
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JIKKEKI-OH-DELIV-03-183 TO
                    S183A-JIKKEKI-OH-DELIV
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JIKKEKI-OH-DELIV-04-183 TO
                    S183A-JIKKEKI-OH-DELIV
                        OF RECORD-BUFCR03(04)
                  MOVE  H--JIKKEKI-OH-UKEIRE-01-183 TO
                    S183A-JIKKEKI-OH-UKEIRE
                        OF RECORD-BUFCR03(01)
                  MOVE  H--JIKKEKI-OH-UKEIRE-02-183 TO
                    S183A-JIKKEKI-OH-UKEIRE
                        OF RECORD-BUFCR03(02)
                  MOVE  H--JIKKEKI-OH-UKEIRE-03-183 TO
                    S183A-JIKKEKI-OH-UKEIRE
                        OF RECORD-BUFCR03(03)
                  MOVE  H--JIKKEKI-OH-UKEIRE-04-183 TO
                    S183A-JIKKEKI-OH-UKEIRE
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-METAL1-01-183 TO
                    S183A-KEIKAKU-OH-METAL1
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-METAL1-02-183 TO
                    S183A-KEIKAKU-OH-METAL1
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-METAL1-03-183 TO
                    S183A-KEIKAKU-OH-METAL1
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-METAL1-04-183 TO
                    S183A-KEIKAKU-OH-METAL1
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-METAL2-01-183 TO
                    S183A-KEIKAKU-OH-METAL2
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-METAL2-02-183 TO
                    S183A-KEIKAKU-OH-METAL2
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-METAL2-03-183 TO
                    S183A-KEIKAKU-OH-METAL2
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-METAL2-04-183 TO
                    S183A-KEIKAKU-OH-METAL2
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-WBS-01-183 TO
                    S183A-KEIKAKU-OH-WBS
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-WBS-02-183 TO
                    S183A-KEIKAKU-OH-WBS
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-WBS-03-183 TO
                    S183A-KEIKAKU-OH-WBS
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-WBS-04-183 TO
                    S183A-KEIKAKU-OH-WBS
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-SHITA-P-01-183 TO
                    S183A-KEIKAKU-OH-SHITA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-SHITA-P-02-183 TO
                    S183A-KEIKAKU-OH-SHITA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-SHITA-P-03-183 TO
                    S183A-KEIKAKU-OH-SHITA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-SHITA-P-04-183 TO
                    S183A-KEIKAKU-OH-SHITA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-NAKA-P-01-183 TO
                    S183A-KEIKAKU-OH-NAKA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-NAKA-P-02-183 TO
                    S183A-KEIKAKU-OH-NAKA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-NAKA-P-03-183 TO
                    S183A-KEIKAKU-OH-NAKA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-NAKA-P-04-183 TO
                    S183A-KEIKAKU-OH-NAKA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-UWA-P-01-183 TO
                    S183A-KEIKAKU-OH-UWA-P
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-UWA-P-02-183 TO
                    S183A-KEIKAKU-OH-UWA-P
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-UWA-P-03-183 TO
                    S183A-KEIKAKU-OH-UWA-P
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-UWA-P-04-183 TO
                    S183A-KEIKAKU-OH-UWA-P
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-PBS-01-183 TO
                    S183A-KEIKAKU-OH-PBS
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-PBS-02-183 TO
                    S183A-KEIKAKU-OH-PBS
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-PBS-03-183 TO
                    S183A-KEIKAKU-OH-PBS
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-PBS-04-183 TO
                    S183A-KEIKAKU-OH-PBS
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-PRE-TRIM-01-183 TO
                    S183A-KEIKAKU-OH-PRE-TRIM
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-PRE-TRIM-02-183 TO
                    S183A-KEIKAKU-OH-PRE-TRIM
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-PRE-TRIM-03-183 TO
                    S183A-KEIKAKU-OH-PRE-TRIM
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-PRE-TRIM-04-183 TO
                    S183A-KEIKAKU-OH-PRE-TRIM
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-TRIM-01-183 TO
                    S183A-KEIKAKU-OH-TRIM
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-TRIM-02-183 TO
                    S183A-KEIKAKU-OH-TRIM
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-TRIM-03-183 TO
                    S183A-KEIKAKU-OH-TRIM
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-TRIM-04-183 TO
                    S183A-KEIKAKU-OH-TRIM
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-FINAL-01-183 TO
                    S183A-KEIKAKU-OH-FINAL
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-FINAL-02-183 TO
                    S183A-KEIKAKU-OH-FINAL
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-FINAL-03-183 TO
                    S183A-KEIKAKU-OH-FINAL
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-FINAL-04-183 TO
                    S183A-KEIKAKU-OH-FINAL
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-KASOU-01-183 TO
                    S183A-KEIKAKU-OH-KASOU
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-KASOU-02-183 TO
                    S183A-KEIKAKU-OH-KASOU
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-KASOU-03-183 TO
                    S183A-KEIKAKU-OH-KASOU
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-KASOU-04-183 TO
                    S183A-KEIKAKU-OH-KASOU
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-DELIV-01-183 TO
                    S183A-KEIKAKU-OH-DELIV
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-DELIV-02-183 TO
                    S183A-KEIKAKU-OH-DELIV
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-DELIV-03-183 TO
                    S183A-KEIKAKU-OH-DELIV
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-DELIV-04-183 TO
                    S183A-KEIKAKU-OH-DELIV
                        OF RECORD-BUFCR03(04)
                  MOVE  H--KEIKAKU-OH-UKEIRE-01-183 TO
                    S183A-KEIKAKU-OH-UKEIRE
                        OF RECORD-BUFCR03(01)
                  MOVE  H--KEIKAKU-OH-UKEIRE-02-183 TO
                    S183A-KEIKAKU-OH-UKEIRE
                        OF RECORD-BUFCR03(02)
                  MOVE  H--KEIKAKU-OH-UKEIRE-03-183 TO
                    S183A-KEIKAKU-OH-UKEIRE
                        OF RECORD-BUFCR03(03)
                  MOVE  H--KEIKAKU-OH-UKEIRE-04-183 TO
                    S183A-KEIKAKU-OH-UKEIRE
                        OF RECORD-BUFCR03(04)
             END-IF.
       E-FETCH-CR03.
             EXIT.
       CLOSE-CR03.
             IF CR03-OPENED = "Y"
                EXEC SQL CLOSE CR03 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR03
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR03-OPENED.
       E-CLOSE-CR03.
             EXIT.
       OPEN-CR04.
             IF CR04-OPENED = "Y"
                EXEC SQL CLOSE CR04 END-EXEC
             END-IF.
             MOVE "Y" TO CR04-OPENED.
             EXEC SQL OPEN   CR04             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR04
                                       SQLCODE.
       E-OPEN-CR04.
             EXIT.
       FETCH-CR04.
             EXEC SQL FETCH CR04 INTO
                 :H--KOUJOU-KUBUN-184
                ,:H--SHAKEI-CODE-184
                ,:H--LINE-KUBUN-184
                ,:H--SHIFT-184
                ,:H--KOUTEI-ID-184
                ,:H--KAISHI-JIKOKU-184
                ,:H--JISSEKI-KAISHI-IZEN-184
                ,:H--JISSEKI-HH-TBL-184
                ,:H--JISSEKI-12H-IKOU-184
                ,:H--KEIKAKU-KAISHI-IZEN-184
                ,:H--KEIKAKU-HH-TBL-184
                ,:H--KEIKAKU-12H-IKOU-184
                ,:H--JIKEI-184-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR04
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-184 TO
                    S184A-KOUJOU-KUBUN
                        OF RECORD-BUFCR04
                  MOVE  H--SHAKEI-CODE-184 TO
                    S184A-SHAKEI-CODE
                        OF RECORD-BUFCR04
                  MOVE  H--LINE-KUBUN-184 TO
                    S184A-LINE-KUBUN
                        OF RECORD-BUFCR04
                  MOVE  H--SHIFT-184 TO
                    S184A-SHIFT
                        OF RECORD-BUFCR04
                  MOVE  H--KOUTEI-ID-184 TO
                    S184A-KOUTEI-ID
                        OF RECORD-BUFCR04
                  MOVE  H--KAISHI-JIKOKU-184 TO
                    S184A-KAISHI-JIKOKU
                        OF RECORD-BUFCR04
                  MOVE  H--JISSEKI-KAISHI-IZEN-184 TO
                    S184A-JISSEKI-KAISHI-IZEN
                        OF RECORD-BUFCR04
                  CALL  "PACK184" USING H--JISSEKI-HH-TBL-184
                    S184A-JISSEKI-HH-TBL
                        OF RECORD-BUFCR04
                        BY VALUE 24
                  MOVE  H--JISSEKI-12H-IKOU-184 TO
                    S184A-JISSEKI-12H-IKOU
                        OF RECORD-BUFCR04
                  MOVE  H--KEIKAKU-KAISHI-IZEN-184 TO
                    S184A-KEIKAKU-KAISHI-IZEN
                        OF RECORD-BUFCR04
                  CALL  "PACK184" USING H--KEIKAKU-HH-TBL-184
                    S184A-KEIKAKU-HH-TBL
                        OF RECORD-BUFCR04
                        BY VALUE 24
                  MOVE  H--KEIKAKU-12H-IKOU-184 TO
                    S184A-KEIKAKU-12H-IKOU
                        OF RECORD-BUFCR04
             END-IF.
       E-FETCH-CR04.
             EXIT.
       CLOSE-CR04.
             IF CR04-OPENED = "Y"
                EXEC SQL CLOSE CR04 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR04
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR04-OPENED.
       E-CLOSE-CR04.
             EXIT.
       OPEN-CR05.
             IF CR05-OPENED = "Y"
                EXEC SQL CLOSE CR05 END-EXEC
             END-IF.
             MOVE "Y" TO CR05-OPENED.
             EXEC SQL OPEN   CR05             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR05
                                       SQLCODE.
       E-OPEN-CR05.
             EXIT.
       FETCH-CR05.
             EXEC SQL FETCH CR05 INTO
                 :H--KOUJOU-KUBUN-FILE-ID-185
                ,:H--ACT-GROUP-185
                ,:H--ACT-LINE-COD-185
                ,:H--YYYYMM-185
                ,:H--KOUTEI-KEIKAKU-ID-185
                ,:H--SHIFT-DAISU-01-185
                ,:H--SHIFT-DAISU-02-185
                ,:H--SHIFT-DAISU-03-185
                ,:H--SHIFT-DAISU-04-185
                ,:H--SHIFT-DAISU-05-185
                ,:H--SHIFT-DAISU-06-185
                ,:H--SHIFT-DAISU-07-185
                ,:H--SHIFT-DAISU-08-185
                ,:H--SHIFT-DAISU-09-185
                ,:H--SHIFT-DAISU-10-185
                ,:H--SHIFT-DAISU-11-185
                ,:H--SHIFT-DAISU-12-185
                ,:H--SHIFT-DAISU-13-185
                ,:H--SHIFT-DAISU-14-185
                ,:H--SHIFT-DAISU-15-185
                ,:H--SHIFT-DAISU-16-185
                ,:H--SHIFT-DAISU-17-185
                ,:H--SHIFT-DAISU-18-185
                ,:H--SHIFT-DAISU-19-185
                ,:H--SHIFT-DAISU-20-185
                ,:H--SHIFT-DAISU-21-185
                ,:H--SHIFT-DAISU-22-185
                ,:H--SHIFT-DAISU-23-185
                ,:H--SHIFT-DAISU-24-185
                ,:H--SHIFT-DAISU-25-185
                ,:H--SHIFT-DAISU-26-185
                ,:H--SHIFT-DAISU-27-185
                ,:H--SHIFT-DAISU-28-185
                ,:H--SHIFT-DAISU-29-185
                ,:H--SHIFT-DAISU-30-185
                ,:H--SHIFT-DAISU-31-185
                ,:H--SHIFT-DAISU-32-185
                ,:H--SHIFT-DAISU-33-185
                ,:H--SHIFT-DAISU-34-185
                ,:H--SHIFT-DAISU-35-185
                ,:H--SHIFT-DAISU-36-185
                ,:H--SHIFT-DAISU-37-185
                ,:H--SHIFT-DAISU-38-185
                ,:H--SHIFT-DAISU-39-185
                ,:H--SHIFT-DAISU-40-185
                ,:H--SHIFT-DAISU-41-185
                ,:H--SHIFT-DAISU-42-185
                ,:H--SHIFT-DAISU-43-185
                ,:H--SHIFT-DAISU-44-185
                ,:H--SHIFT-DAISU-45-185
                ,:H--SHIFT-DAISU-46-185
                ,:H--SHIFT-DAISU-47-185
                ,:H--SHIFT-DAISU-48-185
                ,:H--SHIFT-DAISU-49-185
                ,:H--SHIFT-DAISU-50-185
                ,:H--SHIFT-DAISU-51-185
                ,:H--SHIFT-DAISU-52-185
                ,:H--SHIFT-DAISU-53-185
                ,:H--SHIFT-DAISU-54-185
                ,:H--SHIFT-DAISU-55-185
                ,:H--SHIFT-DAISU-56-185
                ,:H--SHIFT-DAISU-57-185
                ,:H--SHIFT-DAISU-58-185
                ,:H--SHIFT-DAISU-59-185
                ,:H--SHIFT-DAISU-60-185
                ,:H--SHIFT-DAISU-61-185
                ,:H--SHIFT-DAISU-62-185
                ,:H--SHIFT-DAISU-63-185
                ,:H--TIME-STAMP-185
                ,:H--KOUTEI-185-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR05
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-FILE-ID-185 TO
                    S185A-KOUJOU-KUBUN-FILE-ID
                        OF RECORD-BUFCR05
                  MOVE  H--ACT-GROUP-185 TO
                    S185A-ACT-GROUP
                        OF RECORD-BUFCR05
                  MOVE  H--ACT-LINE-COD-185 TO
                    S185A-ACT-LINE-COD
                        OF RECORD-BUFCR05
                  MOVE  H--YYYYMM-185 TO
                    S185A-YYYYMM
                        OF RECORD-BUFCR05
                  MOVE  H--KOUTEI-KEIKAKU-ID-185 TO
                    S185A-KOUTEI-KEIKAKU-ID
                        OF RECORD-BUFCR05
                  MOVE  H--SHIFT-DAISU-01-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(01)
                  MOVE  H--SHIFT-DAISU-02-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(02)
                  MOVE  H--SHIFT-DAISU-03-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(03)
                  MOVE  H--SHIFT-DAISU-04-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(04)
                  MOVE  H--SHIFT-DAISU-05-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(05)
                  MOVE  H--SHIFT-DAISU-06-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(06)
                  MOVE  H--SHIFT-DAISU-07-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(07)
                  MOVE  H--SHIFT-DAISU-08-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(08)
                  MOVE  H--SHIFT-DAISU-09-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(09)
                  MOVE  H--SHIFT-DAISU-10-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(10)
                  MOVE  H--SHIFT-DAISU-11-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(11)
                  MOVE  H--SHIFT-DAISU-12-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(12)
                  MOVE  H--SHIFT-DAISU-13-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(13)
                  MOVE  H--SHIFT-DAISU-14-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(14)
                  MOVE  H--SHIFT-DAISU-15-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(15)
                  MOVE  H--SHIFT-DAISU-16-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(16)
                  MOVE  H--SHIFT-DAISU-17-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(17)
                  MOVE  H--SHIFT-DAISU-18-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(18)
                  MOVE  H--SHIFT-DAISU-19-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(19)
                  MOVE  H--SHIFT-DAISU-20-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(20)
                  MOVE  H--SHIFT-DAISU-21-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(21)
                  MOVE  H--SHIFT-DAISU-22-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(22)
                  MOVE  H--SHIFT-DAISU-23-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(23)
                  MOVE  H--SHIFT-DAISU-24-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(24)
                  MOVE  H--SHIFT-DAISU-25-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(25)
                  MOVE  H--SHIFT-DAISU-26-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(26)
                  MOVE  H--SHIFT-DAISU-27-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(27)
                  MOVE  H--SHIFT-DAISU-28-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(28)
                  MOVE  H--SHIFT-DAISU-29-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(29)
                  MOVE  H--SHIFT-DAISU-30-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(30)
                  MOVE  H--SHIFT-DAISU-31-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(31)
                  MOVE  H--SHIFT-DAISU-32-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(32)
                  MOVE  H--SHIFT-DAISU-33-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(33)
                  MOVE  H--SHIFT-DAISU-34-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(34)
                  MOVE  H--SHIFT-DAISU-35-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(35)
                  MOVE  H--SHIFT-DAISU-36-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(36)
                  MOVE  H--SHIFT-DAISU-37-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(37)
                  MOVE  H--SHIFT-DAISU-38-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(38)
                  MOVE  H--SHIFT-DAISU-39-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(39)
                  MOVE  H--SHIFT-DAISU-40-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(40)
                  MOVE  H--SHIFT-DAISU-41-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(41)
                  MOVE  H--SHIFT-DAISU-42-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(42)
                  MOVE  H--SHIFT-DAISU-43-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(43)
                  MOVE  H--SHIFT-DAISU-44-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(44)
                  MOVE  H--SHIFT-DAISU-45-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(45)
                  MOVE  H--SHIFT-DAISU-46-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(46)
                  MOVE  H--SHIFT-DAISU-47-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(47)
                  MOVE  H--SHIFT-DAISU-48-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(48)
                  MOVE  H--SHIFT-DAISU-49-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(49)
                  MOVE  H--SHIFT-DAISU-50-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(50)
                  MOVE  H--SHIFT-DAISU-51-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(51)
                  MOVE  H--SHIFT-DAISU-52-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(52)
                  MOVE  H--SHIFT-DAISU-53-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(53)
                  MOVE  H--SHIFT-DAISU-54-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(54)
                  MOVE  H--SHIFT-DAISU-55-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(55)
                  MOVE  H--SHIFT-DAISU-56-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(56)
                  MOVE  H--SHIFT-DAISU-57-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(57)
                  MOVE  H--SHIFT-DAISU-58-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(58)
                  MOVE  H--SHIFT-DAISU-59-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(59)
                  MOVE  H--SHIFT-DAISU-60-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(60)
                  MOVE  H--SHIFT-DAISU-61-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(61)
                  MOVE  H--SHIFT-DAISU-62-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(62)
                  MOVE  H--SHIFT-DAISU-63-185 TO
                    S185A-SHIFT-DAISU
                        OF RECORD-BUFCR05(63)
                  MOVE  H--TIME-STAMP-185 TO
                    S185A-TIME-STAMP
                        OF RECORD-BUFCR05
             END-IF.
       E-FETCH-CR05.
             EXIT.
       CLOSE-CR05.
             IF CR05-OPENED = "Y"
                EXEC SQL CLOSE CR05 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR05
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR05-OPENED.
       E-CLOSE-CR05.
             EXIT.
       OPEN-CR06.
             IF CR06-OPENED = "Y"
                EXEC SQL CLOSE CR06 END-EXEC
             END-IF.
             MOVE "Y" TO CR06-OPENED.
             EXEC SQL OPEN   CR06             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR06
                                       SQLCODE.
       E-OPEN-CR06.
             EXIT.
       FETCH-CR06.
             EXEC SQL FETCH CR06 INTO
                 :H--KOUJOU-KUBUN-180
                ,:H--KOUJOU-CONTROL-NO-180
                ,:H--ACT-LINE-CODE-180
                ,:H--POINT2-SEQ-NO-180
                ,:H--POINT3-SEQ-NO-180
                ,:H--POINT4-SEQ-NO-180
                ,:H--TRANSPORT-DIRECTION-MLS233
                ,:H--DOUKISEISAN-SEQ-NO-180
                ,:H--DELIVERY-PLAN-NON-M-MLS234
                ,:H--PRODUCTION-MONTH-180
                ,:H--MS-NO-180
                ,:H--SEQUENCE-180-R
             END-EXEC.
             CALL "MAP-RET-CODE" USING RESPONSE-CODECR06
                                       SQLCODE.
             IF SQLCODE = 0
                  MOVE  H--KOUJOU-KUBUN-180 TO
                    S180A-KOUJOU-KUBUN
                        OF RECORD-BUFCR06
                  MOVE  H--KOUJOU-CONTROL-NO-180 TO
                    S180A-KOUJOU-CONTROL-NO
                        OF RECORD-BUFCR06
                  MOVE  H--ACT-LINE-CODE-180 TO
                    S180A-ACT-LINE-CODE
                        OF RECORD-BUFCR06
                  MOVE  H--POINT2-SEQ-NO-180 TO
                    S180A-POINT2-SEQ-NO
                        OF RECORD-BUFCR06
                  MOVE  H--POINT3-SEQ-NO-180 TO
                    S180A-POINT3-SEQ-NO
                        OF RECORD-BUFCR06
                  MOVE  H--POINT4-SEQ-NO-180 TO
                    S180A-POINT4-SEQ-NO
                        OF RECORD-BUFCR06
                  MOVE  H--TRANSPORT-DIRECTION-MLS233 TO
                    S180A-TRANSPORT-DIRECTION-SYM
                        OF RECORD-BUFCR06
                  MOVE  H--DOUKISEISAN-SEQ-NO-180 TO
                    S180A-DOUKISEISAN-SEQ-NO
                        OF RECORD-BUFCR06
                  MOVE  H--DELIVERY-PLAN-NON-M-MLS234 TO
                    S180A-DELIVERY-PLAN-NON-MARGIN
                        OF RECORD-BUFCR06
                  MOVE  H--PRODUCTION-MONTH-180 TO
                    S180A-PRODUCTION-MONTH
                        OF RECORD-BUFCR06
                  MOVE  H--MS-NO-180 TO
                    S180A-MS-NO
                        OF RECORD-BUFCR06
             END-IF.
       E-FETCH-CR06.
             EXIT.
       CLOSE-CR06.
             IF CR06-OPENED = "Y"
                EXEC SQL CLOSE CR06 END-EXEC
                CALL "MAP-RET-CODE" USING RESPONSE-CODECR06
                                       SQLCODE
             END-IF.
             MOVE "N" TO CR06-OPENED.
       E-CLOSE-CR06.
             EXIT.
