000100 IDENTIFICATION    DIVISION.
000200 PROGRAM-ID.            E62X20.
000300 DATE-WRITTEN.          90/9/20
001300 ENVIRONMENT       DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. HITACM.
       OBJECT-COMPUTER. HITACM.
       SPECIAL-NAMES.
           ENVIRONMENT-NAME  IS ENV-NAME
           ENVIRONMENT-VALUE IS ENV-VALUE.
001700
       FILE-CONTROL.
         SELECT I1-SEIHAN-SHIYOU-BETSU-FL ASSIGN TO EXTERNAL SYS011
         ORGANIZATION SEQUENTIAL.
         SELECT O1-CATS-SHIYOU-BETSU-FL ASSIGN TO EXTERNAL SYS031
         ORGANIZATION SEQUENTIAL.
       DATA            DIVISION.
       FILE SECTION.
       FD I1-SEIHAN-SHIYOU-BETSU-FL.
       01 SYS011-REC                     PIC X(497).
       FD O1-CATS-SHIYOU-BETSU-FL.
       01 SYS031-REC                     PIC X(580).
001900 WORKING-STORAGE   SECTION.
NewSrc 01 DCPENV.
002000       COPY DCPENV  .
002200                   COPY DCPCXCB  REPLACING DDNAME BY 'SYS011'.
002300 01     I1-SEIHAN-SHIYOU-BETSU-REC.
002400   02         I1-KOUJOU-KUBUN                    PIC   X.
002500   02         I1-SHASHU                          PIC   X(18).
002600   02         I1-TOSHOKU                         PIC   X(3).
002700   02         I1-UCHIBARI                        PIC   X.
002800   02         I1-EX-NO                           PIC   X(5).
002900   02         I1-LINE-KUBUN.
003000     03       I1-FILLER                          PIC   X(3).
003100     03       I1-SHIMO-1KETA                     PIC   X.
003200   02         I1-KOKUYU-KUBUN                    PIC   X.
003300   02         I1-TAISHOU-NENGETSU                PIC   X(4).
003400   02         I1-KOUTEI-SHIKIBETSU               PIC   X(2).
003500   02         I1-JISSEKI-DAISU.
003600     03       I1-ZENGETSU-JISSEKI-RUIKEI  PIC  S9(5)  COMP-3.
003700     03       I1-TOUGETSU-JISSEKI.
003800       04     I1-TOUGETSU-JISSEKI-1-0     PIC  S9(3)  COMP-3.
003900       04     I1-TOUGETSU-JISSEKI         OCCURS 31.
004000         05   I1-TOUGETSU-JISSEKI-1       PIC  S9(3)  COMP-3.
004100         05   I1-TOUGETSU-JISSEKI-2       PIC  S9(3)  COMP-3.
004200     03       I1-JIGETSU-JISSEKI.
004300       04     I1-JIGETSU-JISSEKI-1-0      PIC  S9(3)  COMP-3.
004400       04     I1-JIGETSU-JISSEKI          OCCURS 20.
004500         05   I1-JIGETSU-JISSEKI-1        PIC  S9(3)  COMP-3.
004600         05   I1-JIGETSU-JISSEKI-2        PIC  S9(3)  COMP-3.
004700   02         I1-KEIKAKU-DAISU.
004800     03       I1-ZENZEN-GETSU-MATSU-RUISA PIC  S9(5)  COMP-3.
004900     03       I1-ZENGETSU-KEIKAKU-RUIKEI  PIC  S9(5)  COMP-3.
005000     03       I1-ZENGETSU-MATSU-RUISA     PIC  S9(5)  COMP-3.
005100     03       I1-TOUGETSU-KEIKAKU.
005200       04     I1-TOUGETSU-KEIKAKU-1-0     PIC  S9(3)  COMP-3.
005300       04     I1-TOUGETSU-KEIKAKU         OCCURS 31.
005400         05   I1-TOUGETSU-KEIKAKU-1       PIC  S9(3)  COMP-3.
005500         05   I1-TOUGETSU-KEIKAKU-2       PIC  S9(3)  COMP-3.
005600     03       I1-JIGETSU-KEIKAKU.
005700       04     I1-JIGETSU-KEIKAKU-1-0      PIC  S9(3)  COMP-3.
005800       04     I1-JIGETSU-KEIKAKU          OCCURS 20.
005900         05   I1-JIGETSU-KEIKAKU-1        PIC  S9(3)  COMP-3.
006000         05   I1-JIGETSU-KEIKAKU-2        PIC  S9(3)  COMP-3.
006100   02         I1-IKAN-DAISU.
006200     03       I1-ZENGETSU-RUIKEI-IKAN     PIC  S9(5)  COMP-3.
006300     03       I1-TOUGETSU-RUIKEI-IKAN     PIC  S9(5)  COMP-3.
006400     03       I1-JIGETSU-RUIKEI-IKAN      PIC  S9(5)  COMP-3.
006500   02         I1-SHIKYU-DAISU.
006600     03       I1-ZENGETSU-SHIKYU          PIC  S9(5)  COMP-3.
006700     03       I1-TOUGETSU-SHIKYU          PIC  S9(5)  COMP-3.
006800     03       I1-ZIGETSU-SHIKYU           PIC  S9(5)  COMP-3.
006900   02         I1-MIKEN.
007000     03       I1-ZENZEN-GETSU-MIKE        PIC  S9(5)  COMP-3.
007100     03       I1-ZEN-GETSU-MIKEN          PIC  S9(5)  COMP-3.
007200   02         I1-KANKEN.
007300     03       I1-ZENZEN-GETSU-KANKEN      PIC  S9(5)  COMP-3.
007400     03       I1-ZEN-GETSU-KANKEN         PIC  S9(5)  COMP-3.
007500 01           FILLER                      PIC   X(3).
007600
007800                   COPY DCPCXCB  REPLACING DDNAME BY 'SYS031'.
007900 01           O1-CATS-SHIYOU-BETSU-REC.
008000   02         O1-CONTROL-KEY.
008100     03       O1-SHASHU                          PIC   X(18).
008200     03       O1-EX-NO                           PIC   X(5).
008300     03       O1-TOSHOKU                         PIC   X(3).
008400     03       O1-UCHIBARI                        PIC   X.
008500     03       O1-TRIM-LINE                       PIC   X.
008600   02         O1-KOKUYU-KUBUN                    PIC   X.
008700   02         O1-SHIMUKECHI                      PIC   X(3).
008800   02         O1-KOUJOU-KUBUN.
008900     03       O1-KAMI-1KETA                      PIC   X.
009000     03       O1-SHIMO-1KETA                     PIC   X.
009100   02         O1-LIST-JUN                        PIC   X(3).
009200   02         O1-KIJUN-SHAKEI                    PIC   X(5).
009300   02         O1-KEIKAKU-NENGETSU                PIC   X(4).
009400   02         O1-OFF-LINE-KEIKAKU-TOUGETSU.
009500     03       O1-OFF-GETTO-RUISA        PIC  S9(3)   COMP-3.
009600     03       O1-OFF-KEIKAKU-TOUGETSU-DAISU
009700                                PIC S9(3)  COMP-3 OCCURS 31.
009800   02         O1-OFF-LINE-KEIKAKU-GIGETSU.
009900     03       O1-OFF-KEIKAKU-JIGETSU-DAISU
010000                                PIC S9(3)  COMP-3 OCCURS 20.
010100   02         O1-OFF-LINE-JISSEKI-TOUGETSU.
010200     03       O1-OFF-JISSEKI-TOUGETSU-DAISU
010300                                PIC S9(3)  COMP-3 OCCURS 31.
010400   02         O1-OFF-LINE-JISSEKI-JIGETSU.
010500     03       O1-OFF-JISSEKI-JIGETSU-DAISU
010600                                PIC S9(3)  COMP-3 OCCURS 20.
010700   02         O1-FINAL-KEIKAKU-TOUGETSU.
010800     03       O1-FIN-GETTO-RUISA          PIC S9(3)  COMP-3.
010900     03       O1-FIN-KEIKAKU-TOUGETSU-DAISU
011000                                PIC S9(3)  COMP-3 OCCURS 31.
011100   02         O1-FINAL-KEIKAKU-JIGETSU.
011200     03       O1-FIN-KEIKAKU-JIGETSU-DAISU
011300                                PIC S9(3)  COMP-3 OCCURS 20.
011400   02         O1-FINAL-JISSEKI-TOUGETSU.
011500     03       O1-FIN-JISSEKI-TOUGETSU-DAISU
011600                                PIC S9(3)  COMP-3 OCCURS 31.
011700   02         O1-FINAL-JISSEKI-JIGETSU.
011800     03       O1-FIN-JISSEKI-JIGETSU-DAISU
011900                                PIC S9(3)  COMP-3 OCCURS 20.
012000   02         O1-SHAUKE-TOUGETSU.
012100     03       O1-MIKEN-ZAIKO              PIC S9(3)  COMP-3.
012200     03       O1-KANKEN-ZAIKO             PIC S9(3)  COMP-3.
012300     03       O1-SHAUKE-TOUGETSU-DAISU
012400                                PIC S9(3)  COMP-3 OCCURS 31.
012500   02         O1-SHAUKE-JIGETSU.
012600     03       O1-SHAUKE-JIGETSU-DAISU
012700                                PIC S9(3)  COMP-3 OCCURS 20.
012800   02         O1-IKAN-SHIKYU-TOUGETSU     PIC S9(3)  COMP-3.
012900   02         O1-IKAN-SHIKYU-JIGETSU      PIC S9(3)  COMP-3.
013000   02         O1-TIME-STAMP                 PIC  X(12) .
013100
013200 01           I1-FL-CONTROL.
013300   02         I1-EOF-SW                     PIC  X(1) .
013400     88       I1-EOF                        VALUE 'Y' .
013500   02         I1-NSEQ-KEY.
013600     03       I1-NSEQ-KOJO-KUBUN            PIC  X(1) .
013700     03       I1-NSEQ-SHASHU                PIC  X(18) .
013800     03       I1-NSEQ-LINE-1KETA            PIC  X(1) .
013900     03       I1-NSEQ-TOSHOKU               PIC  X(3) .
014000     03       I1-NSEQ-UCHIBARI              PIC  X(1) .
014100     03       I1-NSEQ-EX-NO                 PIC  X(5) .
014200     03       I1-NSEQ-KOUTEI-SHIKIBETSU     PIC  X(2) .
014300   02         I1-OSEQ-KEY                   PIC  X(31) .
014400   02         I1-NSAM-KEY.
014500     03       I1-NSAM-KOUJOU-KUBUN          PIC  X(1) .
014600     03       I1-NSAM-SHASHU                PIC  X(18) .
014700     03       I1-NSAM-LINE-1KETA            PIC  X(1) .
014800     03       I1-NSAM-TOSHOKU               PIC  X(3) .
014900     03       I1-NSAM-UCHIBARI              PIC  X(1) .
015000     03       I1-NSAM-EX-NO                 PIC  X(5) .
015100   02         I1-OSAM-KEY                   PIC  X(29) .
015200 01           I1-CTR                      PIC S9(3)  COMP-3.
015300 01           SW-ON-OFF-CODO.
015400   02         ON-CODE               PIC  X(1)  VALUE 'Y' .
015500   02         OFF-CODE              PIC  X(1)  VALUE 'N' .
015600
PROCS  PROCEDURE DIVISION .
016100 MAIN-SHORI.
016200     PERFORM  KAISI-SHORI.
016300     MOVE  OFF-CODE  TO  I1-EOF-SW.
016400     PERFORM  SEIHAN-SHIYOU-BETSU-FL-INSHORI.
016500     PERFORM  CATS-SHIYOU-BETSU-FL-SAKUSEI
016600                  UNTIL  I1-EOF.
016700     PERFORM  SHURYO-SHORI.
           EXIT PROGRAM.
016900
017100 KAISI-SHORI.
            OPEN INPUT I1-SEIHAN-SHIYOU-BETSU-FL.
            OPEN OUTPUT O1-CATS-SHIYOU-BETSU-FL.
017400     MOVE  LOW-VALUE        TO  I1-NSEQ-KEY.
017500
017700 SEIHAN-SHIYOU-BETSU-FL-INSHORI.
            READ I1-SEIHAN-SHIYOU-BETSU-FL
                 INTO I1-SEIHAN-SHIYOU-BETSU-REC
            AT END
                 MOVE 'EOF ' TO RETCD1
            NOT AT END
                 MOVE 'NML' TO RETCD1
            END-READ.
018100     IF  RETCD1    =  'EOF'
018200         MOVE  ON-CODE         TO  I1-EOF-SW.
018400     IF  NOT   I1-EOF
018500         MOVE  I1-NSEQ-KEY       TO  I1-OSEQ-KEY
018600         MOVE  I1-KOUJOU-KUBUN   TO  I1-NSEQ-KOJO-KUBUN
018700         MOVE  I1-SHASHU         TO  I1-NSEQ-SHASHU
018800         MOVE  I1-SHIMO-1KETA    TO  I1-NSEQ-LINE-1KETA
018900         MOVE  I1-TOSHOKU        TO  I1-NSEQ-TOSHOKU
019000         MOVE  I1-UCHIBARI       TO  I1-NSEQ-UCHIBARI
019100         MOVE  I1-EX-NO          TO  I1-NSEQ-EX-NO
019200         MOVE  I1-KOUTEI-SHIKIBETSU
019300                              TO  I1-NSEQ-KOUTEI-SHIKIBETSU
019400         IF   I1-NSEQ-KEY NOT >  I1-OSEQ-KEY
019500              DISPLAY  'ｾｲﾊﾝｼﾖｳﾍﾞﾂ ﾌｧｲﾙ ｼｰｹﾝｽﾀﾞｳﾝ'
019600                                               UPON CONSOLE
019700              DISPLAY  '**OLD KEY = '  I1-OSEQ-KEY
019800                                             UPON CONSOLE
019900              DISPLAY  '**NEW KEY = '  I1-NSEQ-KEY
020000                                             UPON CONSOLE
020100              CALL  'TERMDUMP'.
020200
020300     IF  NOT  I1-EOF
020400         MOVE I1-KOUJOU-KUBUN    TO  I1-NSAM-KOUJOU-KUBUN
020500         MOVE I1-SHASHU          TO  I1-NSAM-SHASHU
020600         MOVE I1-SHIMO-1KETA     TO  I1-NSAM-LINE-1KETA
020700         MOVE I1-TOSHOKU         TO  I1-NSAM-TOSHOKU
020800         MOVE I1-UCHIBARI        TO  I1-NSAM-UCHIBARI
020900         MOVE I1-EX-NO           TO  I1-NSAM-EX-NO
021000     ELSE
021100         MOVE HIGH-VALUE         TO  I1-NSAM-KEY.
021200
021400 CATS-SHIYOU-BETSU-FL-SAKUSEI.
021500
021600     PERFORM  SEIHAN-SHIYOU-SHOKI-SHORI.
021700     MOVE     I1-NSAM-KEY       TO     I1-OSAM-KEY.
021800     PERFORM  SEIHAN-SAM-SHORI-LOOP
021900         UNTIL  I1-NSAM-KEY  NOT  =  I1-OSAM-KEY.
022000     PERFORM  O1-REC-OUT-SHORI.
022200 SEIHAN-SHIYOU-SHOKI-SHORI.
022300     INITIALIZE  O1-CATS-SHIYOU-BETSU-REC.
022400     MOVE  I1-KOUJOU-KUBUN           TO  O1-KOUJOU-KUBUN.
022500     MOVE  I1-SHASHU                 TO  O1-SHASHU.
022600     MOVE  I1-TOSHOKU                TO  O1-TOSHOKU.
022700     MOVE  I1-UCHIBARI               TO  O1-UCHIBARI.
022800     MOVE  I1-EX-NO                  TO  O1-EX-NO.
022900     MOVE  I1-SHIMO-1KETA            TO  O1-TRIM-LINE.
023000     MOVE  I1-KOKUYU-KUBUN           TO  O1-KOKUYU-KUBUN.
023100     MOVE  I1-TAISHOU-NENGETSU       TO  O1-KEIKAKU-NENGETSU.
023200
023400 SEIHAN-SAM-SHORI-LOOP.
023500     PERFORM  SEIHAN-SAM-SHORI.
023600     PERFORM  SEIHAN-SHIYOU-BETSU-FL-INSHORI.
023700
023800
024000 SEIHAN-SAM-SHORI.
024100
024200    IF               I1-KOUTEI-SHIKIBETSU = '10'
024300        PERFORM      OFF-LINE-SHORI
024400        MOVE         I1-ZENGETSU-MATSU-RUISA
024500                             TO  O1-OFF-GETTO-RUISA
024600    ELSE
024700        IF           ( I1-KOUTEI-SHIKIBETSU = '15'  AND
024800                       I1-KOUJOU-KUBUN = '?' )
024900                   OR
025000                     ( I1-KOUTEI-SHIKIBETSU = '20'  AND
025100                       I1-KOUJOU-KUBUN   NOT  = '?' )
025200            PERFORM  FINAL-SHORI
025300            MOVE     I1-ZENGETSU-MATSU-RUISA
025400                            TO    O1-FIN-GETTO-RUISA
025500        ELSE
025900                IF            I1-KOUTEI-SHIKIBETSU = '30'
025910                    MOVE      I1-ZEN-GETSU-MIKEN
025920                       TO     O1-MIKEN-ZAIKO
025921                    ADD       I1-TOUGETSU-RUIKEI-IKAN
025922                       TO     O1-IKAN-SHIKYU-TOUGETSU
025923                    ADD       I1-JIGETSU-RUIKEI-IKAN
025924                       TO     O1-IKAN-SHIKYU-JIGETSU
025925                    ADD       I1-TOUGETSU-SHIKYU
025926                       TO     O1-IKAN-SHIKYU-TOUGETSU
025927                    ADD       I1-ZIGETSU-SHIKYU
025928                       TO     O1-IKAN-SHIKYU-JIGETSU
025930                ELSE
025940                  IF          I1-KOUTEI-SHIKIBETSU = '50'
026000                    PERFORM   SHAUKE-SHORI
026300                    MOVE      I1-ZEN-GETSU-KANKEN
026400                       TO     O1-KANKEN-ZAIKO.
026900
027100 OFF-LINE-SHORI.
027200     COMPUTE     O1-OFF-JISSEKI-TOUGETSU-DAISU (1) =
027300                 I1-TOUGETSU-JISSEKI-1-0 +
027400                 I1-TOUGETSU-JISSEKI-1 (1) +
027500                 I1-TOUGETSU-JISSEKI-2 (1).
027600     COMPUTE     O1-OFF-JISSEKI-JIGETSU-DAISU (1) =
027700                 I1-JIGETSU-JISSEKI-1-0 +
027800                 I1-JIGETSU-JISSEKI-1 (1) +
027900                 I1-JIGETSU-JISSEKI-2 (1).
028000     COMPUTE     O1-OFF-KEIKAKU-TOUGETSU-DAISU (1) =
028100                 I1-TOUGETSU-KEIKAKU-1-0 +
028200                 I1-TOUGETSU-KEIKAKU-1 (1) +
028300                 I1-TOUGETSU-KEIKAKU-2 (1).
028400     COMPUTE     O1-OFF-KEIKAKU-JIGETSU-DAISU (1) =
028500                 I1-JIGETSU-KEIKAKU-1-0 +
028600                 I1-JIGETSU-KEIKAKU-1 (1) +
028700                 I1-JIGETSU-KEIKAKU-2 (1).
028800     MOVE    2      TO    I1-CTR.
028900     PERFORM  UNTIL  I1-CTR > 31
029000         COMPUTE     O1-OFF-JISSEKI-TOUGETSU-DAISU (I1-CTR) =
029100                     I1-TOUGETSU-JISSEKI-1 (I1-CTR) +
029200                     I1-TOUGETSU-JISSEKI-2 (I1-CTR)
029300         COMPUTE     O1-OFF-KEIKAKU-TOUGETSU-DAISU (I1-CTR) =
029400                     I1-TOUGETSU-KEIKAKU-1  (I1-CTR) +
029500                     I1-TOUGETSU-KEIKAKU-2  (I1-CTR)
029600      ADD         1         TO            I1-CTR
029700     END-PERFORM.
029800     MOVE    2      TO    I1-CTR.
029900     PERFORM  UNTIL  I1-CTR > 20
030000         COMPUTE     O1-OFF-JISSEKI-JIGETSU-DAISU (I1-CTR)  =
030100                     I1-JIGETSU-JISSEKI-1 (I1-CTR)  +
030200                     I1-JIGETSU-JISSEKI-2 (I1-CTR)
030300         COMPUTE     O1-OFF-KEIKAKU-JIGETSU-DAISU (I1-CTR)  =
030400                     I1-JIGETSU-KEIKAKU-1 (I1-CTR)  +
030500                     I1-JIGETSU-KEIKAKU-2 (I1-CTR)
030600         ADD         1          TO     I1-CTR
030700     END-PERFORM.
030800
031000 FINAL-SHORI.
031100     COMPUTE     O1-FIN-JISSEKI-TOUGETSU-DAISU (1) =
031200                 I1-TOUGETSU-JISSEKI-1-0 +
031300                 I1-TOUGETSU-JISSEKI-1 (1) +
031400                 I1-TOUGETSU-JISSEKI-2 (1) .
031500     COMPUTE     O1-FIN-JISSEKI-JIGETSU-DAISU (1) =
031600                 I1-JIGETSU-JISSEKI-1-0 +
031700                 I1-JIGETSU-JISSEKI-1 (1) +
031800                 I1-JIGETSU-JISSEKI-2 (1).
031900     COMPUTE     O1-FIN-KEIKAKU-TOUGETSU-DAISU (1) =
032000                 I1-TOUGETSU-KEIKAKU-1-0 +
032100                 I1-TOUGETSU-KEIKAKU-1 (1) +
032200                 I1-TOUGETSU-KEIKAKU-2 (1).
032300     COMPUTE     O1-FIN-KEIKAKU-JIGETSU-DAISU (1) =
032400                 I1-JIGETSU-KEIKAKU-1-0 +
032500                 I1-JIGETSU-KEIKAKU-1 (1) +
032600                 I1-JIGETSU-KEIKAKU-2 (1).
032700     MOVE    2      TO    I1-CTR.
032800     PERFORM  UNTIL  I1-CTR > 31
032900         COMPUTE     O1-FIN-JISSEKI-TOUGETSU-DAISU (I1-CTR) =
033000                     I1-TOUGETSU-JISSEKI-1 (I1-CTR) +
033100                     I1-TOUGETSU-JISSEKI-2 (I1-CTR)
033200         COMPUTE     O1-FIN-KEIKAKU-TOUGETSU-DAISU (I1-CTR) =
033300                     I1-TOUGETSU-KEIKAKU-1  (I1-CTR) +
033400                     I1-TOUGETSU-KEIKAKU-2  (I1-CTR)
033500      ADD         1         TO            I1-CTR
033600     END-PERFORM.
033700     MOVE    2      TO    I1-CTR.
033800     PERFORM  UNTIL  I1-CTR > 20
033900         COMPUTE     O1-FIN-JISSEKI-JIGETSU-DAISU (I1-CTR)  =
034000                     I1-JIGETSU-JISSEKI-1 (I1-CTR)  +
034100                     I1-JIGETSU-JISSEKI-2 (I1-CTR)
034200         COMPUTE     O1-FIN-KEIKAKU-JIGETSU-DAISU (I1-CTR)  =
034300                     I1-JIGETSU-KEIKAKU-1 (I1-CTR)  +
034400                     I1-JIGETSU-KEIKAKU-2 (I1-CTR)
034500         ADD         1          TO     I1-CTR
034600     END-PERFORM.
034700
034900 TSUKI-BETSU-SHORI.
035000     MOVE   I1-TOUGETSU-JISSEKI-1-0  TO  O1-IKAN-SHIKYU-TOUGETSU.
035100     MOVE             1              TO     I1-CTR.
035200     PERFORM  UNTIL  I1-CTR  >  31
035300         COMPUTE     O1-IKAN-SHIKYU-TOUGETSU  =
035400                     I1-TOUGETSU-JISSEKI-1 (I1-CTR) +
035500                     I1-TOUGETSU-JISSEKI-2 (I1-CTR) +
035600                     O1-IKAN-SHIKYU-TOUGETSU
035700         ADD          1        TO      I1-CTR
035800     END-PERFORM.
035900     MOVE   I1-JIGETSU-JISSEKI-1-0  TO  O1-IKAN-SHIKYU-JIGETSU.
036000     MOVE             1              TO     I1-CTR.
036100     PERFORM  UNTIL  I1-CTR  >  20
036200         COMPUTE     O1-IKAN-SHIKYU-JIGETSU  =
036300                     I1-JIGETSU-JISSEKI-1 (I1-CTR) +
036400                     I1-JIGETSU-JISSEKI-2 (I1-CTR) +
036500                     O1-IKAN-SHIKYU-JIGETSU
036600         ADD          1        TO      I1-CTR
036700     END-PERFORM.
036800
037000 SHAUKE-SHORI.
037100     COMPUTE  O1-SHAUKE-TOUGETSU-DAISU (1) =
037200              I1-TOUGETSU-JISSEKI-1-0  +
037300              I1-TOUGETSU-JISSEKI-1  (1) +
037400              I1-TOUGETSU-JISSEKI-2  (1) .
037500     MOVE     2    TO     I1-CTR.
037600     PERFORM   UNTIL  I1-CTR     >  31
037700         COMPUTE    O1-SHAUKE-TOUGETSU-DAISU (I1-CTR)  =
037800                    I1-TOUGETSU-JISSEKI-1 (I1-CTR) +
037900                    I1-TOUGETSU-JISSEKI-2 (I1-CTR)
038000         ADD        1      TO      I1-CTR
038100     END-PERFORM.
038200     COMPUTE  O1-SHAUKE-JIGETSU-DAISU (1) =
038300              I1-JIGETSU-JISSEKI-1-0  +
038400              I1-JIGETSU-JISSEKI-1  (1) +
038500              I1-JIGETSU-JISSEKI-2  (1) .
038600     MOVE     2    TO     I1-CTR.
038700     PERFORM   UNTIL  I1-CTR     >  20
038800         COMPUTE    O1-SHAUKE-JIGETSU-DAISU (I1-CTR)  =
038900                    I1-JIGETSU-JISSEKI-1 (I1-CTR) +
039000                    I1-JIGETSU-JISSEKI-2 (I1-CTR)
039100         ADD        1      TO      I1-CTR
039200     END-PERFORM.
039300
039500 O1-REC-OUT-SHORI.
            WRITE SYS031-REC
                  FROM O1-CATS-SHIYOU-BETSU-REC.
039800
040000 SHURYO-SHORI.
            CLOSE I1-SEIHAN-SHIYOU-BETSU-FL.
            CLOSE O1-CATS-SHIYOU-BETSU-FL.
